<?

$names = [
    "Абрам"=> [
        "translit"=> "abram",
        "genitive"=> "Абрама",
        "variants"=> [
            "абрам",
            "абрамчик",
            "абрамушка"
        ]
    ],
    "Август"=> [
        "translit"=> "avgust",
        "genitive"=> "Августа",
        "variants"=> [
            "август",
            "августик",
            "августинчик"
        ]
    ],
    "Авдотья"=> [
        "translit"=> "avdotya",
        "genitive"=> "Авдотьи",
        "variants"=> [
            "авдотья",
            "дуся",
            "дуня",
            "доня",
            "авдотушка"
        ]
    ],
    "Авраам"=> [
        "translit"=> "avraam",
        "genitive"=> "Авраама",
        "variants"=> [
            "авраам",
            "аврамчик",
            "аврамушка"
        ]
    ],
    "Аврелия"=> [
        "translit"=> "avreliya",
        "genitive"=> "Аврелии",
        "variants"=> [
            "аврелия"
        ]
    ],
    "Аврора"=> [
        "translit"=> "avrora",
        "genitive"=> "Авроры",
        "variants"=> [
            "аврора",
            "ава",
            "аврорушка"
        ]
    ],
    "Агата"=> [
        "translit"=> "agata",
        "genitive"=> "Агаты",
        "variants"=> [
            "агата",
            "гата",
            "агатушка",
            "гата",
            "гаточка"
        ]
    ],
    "Агафия"=> [
        "translit"=> "agafiya",
        "genitive"=> "Агафии",
        "variants"=> [
            "агафия",
            "аганя",
            "аганя",
            "аганя"
        ]
    ],
    "Агафья"=> [
        "translit"=> "agafya",
        "genitive"=> "Агафьи",
        "variants"=> [
            "агафья",
            "аганя",
            "аганя",
            "аганя"
        ]
    ],
    "Аглая"=> [
        "translit"=> "aglaya",
        "genitive"=> "Аглаи",
        "variants"=> [
            "аглая",
            "аглаечка"
        ]
    ],
    "Агнеса"=> [
        "translit"=> "agnesa",
        "genitive"=> "Агнесы",
        "variants"=> [
            "агнеса",
            "агнесочка"
        ]
    ],
    "Агнесса"=> [
        "translit"=> "agnessa",
        "genitive"=> "Агнессы",
        "variants"=> [
            "агнесса",
            "агнессочка"
        ]
    ],
    "Агния"=> [
        "translit"=> "agniya",
        "genitive"=> "Агнии",
        "variants"=> [
            "агния",
            "агнаточка"
        ]
    ],
    "Ада"=> [
        "translit"=> "ada",
        "genitive"=> "Ады",
        "variants"=> [
            "ада",
            "адочка",
            "адуля",
            "адюня",
            "аделинка"
        ]
    ],
    "Адам"=> [
        "translit"=> "adam",
        "genitive"=> "Адама",
        "variants"=> [
            "адам",
            "адамчик",
            "адамушка"
        ]
    ],
    "Аделина"=> [
        "translit"=> "adelina",
        "genitive"=> "Аделины",
        "variants"=> [
            "аделина",
            "аделиночка"
        ]
    ],
    "Аделия"=> [
        "translit"=> "adeliya",
        "genitive"=> "Аделии",
        "variants"=> [
            "аделия",
            "аделичка"
        ]
    ],
    "Адель"=> [
        "translit"=> "adel",
        "genitive"=> "Адели",
        "variants"=> [
            "адель",
            "аделечка",
            "аделя"
        ]
    ],
    "Азалия"=> [
        "translit"=> "azaliya",
        "genitive"=> "Азалии",
        "variants"=> [
            "азалия",
            "аза"
        ]
    ],
    "Аида"=> [
        "translit"=> "aida",
        "genitive"=> "Аиды",
        "variants"=> [
            "аида",
            "ида",
            "аидочка"
        ]
    ],
    "Айгуль"=> [
        "translit"=> "ajgul",
        "genitive"=> "Айгуль",
        "variants"=> [
            "айгуль",
            "айгуленька"
        ]
    ],
    "Айлин"=> [
        "translit"=> "ajlin",
        "genitive"=> "Айлин",
        "variants"=> [
            "айлин",
            "айлиночка"
        ]
    ],
    "Акбар"=> [
        "translit"=> "akbar",
        "genitive"=> "Акбара",
        "variants"=> [
            "акбар",
            "акбарчик",
            "акбарушка"
        ]
    ],
    "Аким"=> [
        "translit"=> "akim",
        "genitive"=> "Акима",
        "variants"=> [
            "аким",
            "акимчик",
            "акимушка",
            "акиша"
        ]
    ],
    "Аксинья"=> [
        "translit"=> "aksinya",
        "genitive"=> "Аксиньи",
        "variants"=> [
            "аксинья",
            "аксиньечка"
        ]
    ],
    "Алевтина"=> [
        "translit"=> "alevtina",
        "genitive"=> "Алевтины",
        "variants"=> [
            "алевтина",
            "алевтиночка"
        ]
    ],
    "Александр"=> [
        "translit"=> "aleksandr",
        "genitive"=> "Саши",
        "variants"=> [
            "александр",
            "саша",
            "сашенька",
            "сашуля",
            "саня"
        ]
    ],
    "Александра"=> [
        "translit"=> "aleksandra",
        "genitive"=> "Саши",
        "variants"=> [
            "александра",
            "саша",
            "сашенька",
            "сашуля",
            "шура",
            "сашута",
            "саня"
        ]
    ],
    "Алёна"=> [
        "translit"=> "alyona",
        "genitive"=> "Алёны",
        "variants"=> [
            "алена",
            "аленочка",
            "аленушка",
            "аленка",
            "алиша",
            "алечка",
            "оля"
        ]
    ],
    "Али"=> [
        "translit"=> "ali",
        "genitive"=> "Али",
        "variants"=> [
            "али"
        ]
    ],
    "Алика"=> [
        "translit"=> "alika",
        "genitive"=> "Алики",
        "variants"=> [
            "алика"
        ]
    ],
    "Алина"=> [
        "translit"=> "alina",
        "genitive"=> "Алины",
        "variants"=> [
            "алина",
            "алиночка",
            "алиша"
        ]
    ],
    "Алиса"=> [
        "translit"=> "alisa",
        "genitive"=> "Алисы",
        "variants"=> [
            "алиса",
            "алисочка",
            "алисанька",
            "алисонька",
            "алечка",
            "лисена"
        ]
    ],
    "Алисия"=> [
        "translit"=> "alisiya",
        "genitive"=> "Алисии",
        "variants"=> [
            "алисия"
        ]
    ],
    "Алла"=> [
        "translit"=> "alla",
        "genitive"=> "Аллы",
        "variants"=> [
            "алла",
            "аллочка",
            "аля",
            "аленка"
        ]
    ],
    "Алсу"=> [
        "translit"=> "alsu",
        "genitive"=> "Алсу",
        "variants"=> [
            "алсу"
        ]
    ],
    "Альберт"=> [
        "translit"=> "albert",
        "genitive"=> "Альберта",
        "variants"=> [
            "альберт",
            "альбертик",
            "алик",
            "альбертушка"
        ]
    ],
    "Альбина"=> [
        "translit"=> "albina",
        "genitive"=> "Альбины",
        "variants"=> [
            "альбина",
            "альбиночка"
        ]
    ],
    "Альфия"=> [
        "translit"=> "alfiya",
        "genitive"=> "Альфии",
        "variants"=> [
            "альфия"
        ]
    ],
    "Амелия"=> [
        "translit"=> "ameliya",
        "genitive"=> "Амелии",
        "variants"=> [
            "амелия"
        ]
    ],
    "Амилия"=> [
        "translit"=> "amiliya",
        "genitive"=> "Амилии",
        "variants"=> [
            "амилия"
        ]
    ],
    "Амина"=> [
        "translit"=> "amina",
        "genitive"=> "Амины",
        "variants"=> [
            "амина",
            "аминочка",
            "амиша",
            "аминка"
        ]
    ],
    "Амира"=> [
        "translit"=> "amira",
        "genitive"=> "Амиры",
        "variants"=> [
            "амира",
            "амирочка"
        ]
    ],
    "Ангелина"=> [
        "translit"=> "angelina",
        "genitive"=> "Ангелины",
        "variants"=> [
            "ангелина",
            "геля",
            "ангелиночка"
        ]
    ],
    "Андрей"=> [
        "translit"=> "andrej",
        "genitive"=> "Андрея",
        "variants"=> [
            "андрей",
            "андрюша",
            "андрюшенька"
        ]
    ],
    "Андриана"=> [
        "translit"=> "andriana",
        "genitive"=> "Андрианы",
        "variants"=> [
            "андриана",
            "андрианочка"
        ]
    ],
    "Анжела"=> [
        "translit"=> "anzhela",
        "genitive"=> "Анжелы",
        "variants"=> [
            "анжела",
            "анжелочка"
        ]
    ],
    "Анжелика"=> [
        "translit"=> "anzhelika",
        "genitive"=> "Анжелики",
        "variants"=> [
            "анжелика"
        ]
    ],
    "Анисим"=> [
        "translit"=> "anisim",
        "genitive"=> "Анисима",
        "variants"=> [
            "анисим",
            "анисимушка",
            "анисимчик"
        ]
    ],
    "Анисия"=> [
        "translit"=> "anisiya",
        "genitive"=> "Анисии",
        "variants"=> [
            "анисия"
        ]
    ],
    "Анита"=> [
        "translit"=> "anita",
        "genitive"=> "Аниты",
        "variants"=> [
            "анита",
            "аниточка"
        ]
    ],
    "Анна-Мария"=> [
        "translit"=> "anna-mariya",
        "genitive"=> "Анны-Марии",
        "variants"=> [
            "анна-мария"
        ]
    ],
    "Антон"=> [
        "translit"=> "anton",
        "genitive"=> "Антона",
        "variants"=> [
            "антон",
            "антошка",
            "антошенька",
            "тошенька",
            "тоха",
            "тоша",
            "антоша"
        ]
    ],
    "Антонина"=> [
        "translit"=> "antonina",
        "genitive"=> "Антонины",
        "variants"=> [
            "антонина",
            "тоня",
            "антониночка"
        ]
    ],
    "Анфиса"=> [
        "translit"=> "anfisa",
        "genitive"=> "Анфисы",
        "variants"=> [
            "анфиса",
            "анфисочка"
        ]
    ],
    "Аня"=> [
        "translit"=> "anya",
        "genitive"=> "Ани",
        "variants"=> [
            "аня",
            "анна",
            "анечка",
            "анюта"
        ]
    ],
    "Аполлинария"=> [
        "translit"=> "apollinariya",
        "genitive"=> "Аполлинарии",
        "variants"=> [
            "аполлинария",
            "полина"
        ]
    ],
    "Апполинарий"=> [
        "translit"=> "appolinarij",
        "genitive"=> "Апполинария",
        "variants"=> [
            "апполинарий"
        ]
    ],
    "Ариана"=> [
        "translit"=> "ariana",
        "genitive"=> "Арианы",
        "variants"=> [
            "ариана",
            "арианочка"
        ]
    ],
    "Арина"=> [
        "translit"=> "arina",
        "genitive"=> "Арины",
        "variants"=> [
            "арина",
            "ариночка",
            "ариша"
        ]
    ],
    "Аркадий"=> [
        "translit"=> "arkadij",
        "genitive"=> "Аркадия",
        "variants"=> [
            "аркадий",
            "аркашенька",
            "аркаша"
        ]
    ],
    "Армен"=> [
        "translit"=> "armen",
        "genitive"=> "Армена",
        "variants"=> [
            "армен",
            "арменчик",
            "арменушка"
        ]
    ],
    "Арнольд"=> [
        "translit"=> "arnold",
        "genitive"=> "Арнольда",
        "variants"=> [
            "арнольд",
            "арнольдушка",
            "арнольдик"
        ]
    ],
    "Арсен"=> [
        "translit"=> "arsen",
        "genitive"=> "Арсена",
        "variants"=> [
            "арсен",
            "арсенчик",
            "арсик"
        ]
    ],
    "Арсений"=> [
        "translit"=> "arsenij",
        "genitive"=> "Арсения",
        "variants"=> [
            "арсений",
            "арсенюшка",
            "арсеньчик",
            "сеня",
            "сенечка",
            "арсюша"
        ]
    ],
    "Артём"=> [
        "translit"=> "artyom",
        "genitive"=> "Артёма",
        "variants"=> [
            "артем",
            "артемий",
            "артемушка",
            "артемчик",
            "артемий",
            "артемка"
        ]
    ],
    "Артур"=> [
        "translit"=> "artur",
        "genitive"=> "Артура",
        "variants"=> [
            "артур",
            "артурчик",
            "артюшенька",
            "артурка"
        ]
    ],
    "Архип"=> [
        "translit"=> "arhip",
        "genitive"=> "Архипа",
        "variants"=> [
            "архип",
            "архипушка",
            "архипчик",
            "архипка"
        ]
    ],
    "Аскольд"=> [
        "translit"=> "askold",
        "genitive"=> "Аскольда",
        "variants"=> [
            "аскольд",
            "аскольдушка",
            "аскольдик"
        ]
    ],
    "Аслан"=> [
        "translit"=> "aslan",
        "genitive"=> "Аслана",
        "variants"=> [
            "аслан",
            "асланчик",
            "асланушка"
        ]
    ],
    "Ася"=> [
        "translit"=> "asya",
        "genitive"=> "Аси",
        "variants"=> [
            "ася",
            "асечка"
        ]
    ],
    "Афанасий"=> [
        "translit"=> "afanasij",
        "genitive"=> "Афанасия",
        "variants"=> [
            "афанасий",
            "афанасьюшка",
            "фаня",
            "афанася"
        ]
    ],
    "Афанасия"=> [
        "translit"=> "afanasiya",
        "genitive"=> "Афанасии",
        "variants"=> [
            "афанасия",
            "афоня",
            "анфисочка"
        ]
    ],
    "Ахмад"=> [
        "translit"=> "ahmad",
        "genitive"=> "Ахмеда",
        "variants"=> [
            "ахмад",
            "ахмадушка",
            "ахмадик"
        ]
    ],
    "Ашот"=> [
        "translit"=> "ashot",
        "genitive"=> "Ашота",
        "variants"=> [
            "ашот",
            "ашотушка",
            "ашотик"
        ]
    ],
    "Бажена"=> [
        "translit"=> "bazhena",
        "genitive"=> "Бажены",
        "variants"=> [
            "бажена",
            "боженочка"
        ]
    ],
    "Батыр"=> [
        "translit"=> "batyr",
        "genitive"=> "Батыра",
        "variants"=> [
            "батыр",
            "батырхан",
            "батырбек",
            "батырушка"
        ]
    ],
    "Беата"=> [
        "translit"=> "beata",
        "genitive"=> "Беаты",
        "variants"=> [
            "беата",
            "беаточка"
        ]
    ],
    "Беатриса"=> [
        "translit"=> "beatrisa",
        "genitive"=> "Беатрисы",
        "variants"=> [
            "беатриса",
            "беатрисочка"
        ]
    ],
    "Бела"=> [
        "translit"=> "bela",
        "genitive"=> "Белы",
        "variants"=> [
            "бела",
            "белочка"
        ]
    ],
    "Богдан"=> [
        "translit"=> "bogdan",
        "genitive"=> "Богдана",
        "variants"=> [
            "богдан",
            "богданчик",
            "богдаша"
        ]
    ],
    "Богдана"=> [
        "translit"=> "bogdana",
        "genitive"=> "Богданы",
        "variants"=> [
            "богдана",
            "богданочка"
        ]
    ],
    "Борислав"=> [
        "translit"=> "borislav",
        "genitive"=> "Борислава",
        "variants"=> [
            "борислав",
            "бориславчик",
            "бориславушка"
        ]
    ],
    "Борислава"=> [
        "translit"=> "borislava",
        "genitive"=> "Бориславы",
        "variants"=> [
            "борислава"
        ]
    ],
    "Боря"=> [
        "translit"=> "borya",
        "genitive"=> "Бори",
        "variants"=> [
            "боря",
            "борис",
            "борюшка",
            "бориска",
            "боренька",
            "борюня",
            "боречка"
        ]
    ],
    "Вадим"=> [
        "translit"=> "vadim",
        "genitive"=> "Вадима",
        "variants"=> [
            "вадим",
            "вадик",
            "вадимка",
            "вадимочка",
            "вадимчик"
        ]
    ],
    "Валентин"=> [
        "translit"=> "valentin",
        "genitive"=> "Вали",
        "variants"=> [
            "валентин",
            "валя",
            "валенька",
            "валюша",
            "валюнчик",
            "валентинка",
            "валюня"
        ]
    ],
    "Валентина"=> [
        "translit"=> "valentina",
        "genitive"=> "Валентины",
        "variants"=> [
            "валентина",
            "валя",
            "валюша"
        ]
    ],
    "Валерий"=> [
        "translit"=> "valerij",
        "genitive"=> "Валерия",
        "variants"=> [
            "валерий",
            "валера",
            "валерочка",
            "валерчик",
            "валюша"
        ]
    ],
    "Ваня"=> [
        "translit"=> "vanya",
        "genitive"=> "Вани",
        "variants"=> [
            "ваня",
            "иван",
            "ванечка",
            "ванюша",
            "иванушка",
            "ивасик",
            "иваша"
        ]
    ],
    "Варвара"=> [
        "translit"=> "varvara",
        "genitive"=> "Варвары",
        "variants"=> [
            "варвара",
            "варварочка",
            "варечка",
            "варюша",
            "варюня"
        ]
    ],
    "Василина"=> [
        "translit"=> "vasilina",
        "genitive"=> "Василины",
        "variants"=> [
            "василина",
            "василиночка",
            "василинушка",
            "васена",
            "вася",
            "васечка",
            "васеша"
        ]
    ],
    "Василиса"=> [
        "translit"=> "vasilisa",
        "genitive"=> "Василисы",
        "variants"=> [
            "василиса",
            "василисочка",
            "васечка",
            "васенька"
        ]
    ],
    "Вася"=> [
        "translit"=> "vasya",
        "genitive"=> "Васи",
        "variants"=> [
            "вася",
            "василий",
            "васенька",
            "васечка",
            "васюня"
        ]
    ],
    "Вениамин"=> [
        "translit"=> "veniamin",
        "genitive"=> "Вениамина",
        "variants"=> [
            "вениамин",
            "веня",
            "венюша",
            "вениаминушка",
            "вениаминчик"
        ]
    ],
    "Вера"=> [
        "translit"=> "vera",
        "genitive"=> "Веры",
        "variants"=> [
            "вера",
            "верочка",
            "веруша",
            "веруля",
            "верунчик"
        ]
    ],
    "Вероника"=> [
        "translit"=> "veronika",
        "genitive"=> "Вероники",
        "variants"=> [
            "вероника"
        ]
    ],
    "Веста"=> [
        "translit"=> "vesta",
        "genitive"=> "Весты",
        "variants"=> [
            "веста",
            "весточка"
        ]
    ],
    "Вика"=> [
        "translit"=> "vika",
        "genitive"=> "Вики",
        "variants"=> [
            "вика",
            "виктория",
            "викочка",
            "викуся",
            "викуша",
            "викуля"
        ]
    ],
    "Вильгельм"=> [
        "translit"=> "vilgelm",
        "genitive"=> "Вильгельма",
        "variants"=> [
            "вильгельм",
            "уилл",
            "вильгельмушка",
            "вильгельмчик"
        ]
    ],
    "Вильям"=> [
        "translit"=> "vilyam",
        "genitive"=> "Вильяма",
        "variants"=> [
            "вильям",
            "вилли",
            "вильямчик"
        ]
    ],
    "Виола"=> [
        "translit"=> "viola",
        "genitive"=> "Виолы",
        "variants"=> [
            "виола",
            "виолочка"
        ]
    ],
    "Виолетта"=> [
        "translit"=> "violetta",
        "genitive"=> "Виолетты",
        "variants"=> [
            "виолетта",
            "виолетточка"
        ]
    ],
    "Виссарион"=> [
        "translit"=> "vissarion",
        "genitive"=> "Виссариона",
        "variants"=> [
            "виссарион",
            "виссарионушка",
            "виссариончик",
            "висенька",
            "вися"
        ]
    ],
    "Виталий"=> [
        "translit"=> "vitalij",
        "genitive"=> "Виталия",
        "variants"=> [
            "виталий",
            "виталик",
            "виталик",
            "виталенька",
            "виталечка",
            "виталька"
        ]
    ],
    "Витя"=> [
        "translit"=> "vitya",
        "genitive"=> "Вити",
        "variants"=> [
            "витя",
            "виктор",
            "витек",
            "витенька",
            "витюша",
            "витюня"
        ]
    ],
    "Влада"=> [
        "translit"=> "vlada",
        "genitive"=> "Влады",
        "variants"=> [
            "влада",
            "владочка",
            "владушка"
        ]
    ],
    "Владислав"=> [
        "translit"=> "vladislav",
        "genitive"=> "Владислава",
        "variants"=> [
            "владислав",
            "влад",
            "владик",
            "владенька",
            "слава",
            "славик"
        ]
    ],
    "Владислава"=> [
        "translit"=> "vladislava",
        "genitive"=> "Владиславы",
        "variants"=> [
            "владислава",
            "слава",
            "славонька",
            "владиславочка"
        ]
    ],
    "Вова"=> [
        "translit"=> "vova",
        "genitive"=> "Вовы",
        "variants"=> [
            "вова",
            "владимир",
            "володя",
            "володенька",
            "володечка",
            "володюшка",
            "вовочка"
        ]
    ],
    "Вольдемар"=> [
        "translit"=> "voldemar",
        "genitive"=> "Вольдемара",
        "variants"=> [
            "вольдемар",
            "вольдемарушка",
            "вольдемарчик",
            "вольдик"
        ]
    ],
    "Галина"=> [
        "translit"=> "galina",
        "genitive"=> "Галины",
        "variants"=> [
            "галина",
            "галя",
            "галиночка",
            "галюша",
            "галочка"
        ]
    ],
    "Гамлет"=> [
        "translit"=> "gamlet",
        "genitive"=> "Гамлета",
        "variants"=> [
            "гамлет"
        ]
    ],
    "Гена"=> [
        "translit"=> "gena",
        "genitive"=> "Гены",
        "variants"=> [
            "гена",
            "генадий",
            "гешенька",
            "геночка",
            "геша",
            "жора",
            "гоша"
        ]
    ],
    "Георгий"=> [
        "translit"=> "georgij",
        "genitive"=> "Георгия",
        "variants"=> [
            "георгий",
            "гоша",
            "герочка",
            "жора",
            "гошенька",
            "гоша"
        ]
    ],
    "Гера"=> [
        "translit"=> "gera",
        "genitive"=> "Геры",
        "variants"=> [
            "гера",
            "герочка",
            "геронька",
            "геруся",
            "жора",
            "гоша"
        ]
    ],
    "Герасим"=> [
        "translit"=> "gerasim",
        "genitive"=> "Герасима",
        "variants"=> [
            "герасим",
            "герушка",
            "герасимушка",
            "герасимчик",
            "жора",
            "гоша"
        ]
    ],
    "Герман"=> [
        "translit"=> "german",
        "genitive"=> "Германа",
        "variants"=> [
            "герман",
            "геруська",
            "гоша",
            "жора"
        ]
    ],
    "Глафира"=> [
        "translit"=> "glafira",
        "genitive"=> "Глафиры",
        "variants"=> [
            "глафира",
            "главифирочка",
            "глаша"
        ]
    ],
    "Глеб"=> [
        "translit"=> "gleb",
        "genitive"=> "Глеба",
        "variants"=> [
            "глеб",
            "глебушка",
            "глебка",
            "глебонька"
        ]
    ],
    "Глория"=> [
        "translit"=> "gloriya",
        "genitive"=> "Глории",
        "variants"=> [
            "глория"
        ]
    ],
    "Гоги"=> [
        "translit"=> "gogi",
        "genitive"=> "Гоги",
        "variants"=> [
            "гоги"
        ]
    ],
    "Гордей"=> [
        "translit"=> "gordej",
        "genitive"=> "Гордея",
        "variants"=> [
            "гордей",
            "гордейчик",
            "гордеюшка",
            "гордеечка"
        ]
    ],
    "Горислав"=> [
        "translit"=> "gorislav",
        "genitive"=> "Горислава",
        "variants"=> [
            "горислав",
            "гориславек",
            "гориславушка",
            "гориславчик"
        ]
    ],
    "Гочи"=> [
        "translit"=> "gochi",
        "genitive"=> "Гочи",
        "variants"=> [
            "гочи"
        ]
    ],
    "Гриша"=> [
        "translit"=> "grisha",
        "genitive"=> "Гриши",
        "variants"=> [
            "гриша",
            "григорий",
            "гришенька",
            "гришаня",
            "гришуня",
            "гриня"
        ]
    ],
    "Гульназ"=> [
        "translit"=> "gulnaz",
        "genitive"=> "Гульназ",
        "variants"=> [
            "гульназ"
        ]
    ],
    "Давид"=> [
        "translit"=> "david",
        "genitive"=> "Давида",
        "variants"=> [
            "давид",
            "давидик",
            "давидушка",
            "давидка",
            "додик"
        ]
    ],
    "Дамир"=> [
        "translit"=> "damir",
        "genitive"=> "Дамира",
        "variants"=> [
            "дамир",
            "дамирчик",
            "дамирушка",
            "дамик",
            "мирчик"
        ]
    ],
    "Дана"=> [
        "translit"=> "dana",
        "genitive"=> "Даны",
        "variants"=> [
            "дана",
            "даночка"
        ]
    ],
    "Даниела"=> [
        "translit"=> "daniela",
        "genitive"=> "Даниелы",
        "variants"=> [
            "даниела",
            "даниэла",
            "даниелочка"
        ]
    ],
    "Даниил"=> [
        "translit"=> "daniil",
        "genitive"=> "Даниила",
        "variants"=> [
            "даниил",
            "даниилушка",
            "даня",
            "данечка",
            "данилушка",
            "даня"
        ]
    ],
    "Данила"=> [
        "translit"=> "danila",
        "genitive"=> "Данилы",
        "variants"=> [
            "данила",
            "данильчик",
            "данилка",
            "даня"
        ]
    ],
    "Данис"=> [
        "translit"=> "danis",
        "genitive"=> "Даниса",
        "variants"=> [
            "данис",
            "данисушка",
            "дениска",
            "денисочка",
            "деня",
            "денка"
        ]
    ],
    "Даниэль"=> [
        "translit"=> "daniel",
        "genitive"=> "Даниэля",
        "variants"=> [
            "даниэль",
            "даниэлушка",
            "даниэльчик"
        ]
    ],
    "Дара"=> [
        "translit"=> "dara",
        "genitive"=> "Дары",
        "variants"=> [
            "дара",
            "дарочка"
        ]
    ],
    "Дарина"=> [
        "translit"=> "darina",
        "genitive"=> "Дарины",
        "variants"=> [
            "дарина",
            "дариночка"
        ]
    ],
    "Даша"=> [
        "translit"=> "dasha",
        "genitive"=> "Даши",
        "variants"=> [
            "даша",
            "дарья",
            "дашенька",
            "дашечка",
            "дашута",
            "дашуля"
        ]
    ],
    "Демид"=> [
        "translit"=> "demid",
        "genitive"=> "Демида",
        "variants"=> [
            "демид",
            "демидушка",
            "диомид"
        ]
    ],
    "Демьян"=> [
        "translit"=> "demyan",
        "genitive"=> "Демьяна",
        "variants"=> [
            "демьян",
            "демьянчик",
            "дема",
            "демочка",
            "демушка"
        ]
    ],
    "Денис"=> [
        "translit"=> "denis",
        "genitive"=> "Дениса",
        "variants"=> [
            "денис",
            "дениска",
            "денисочка",
            "денисонька",
            "денисушка",
            "деня"
        ]
    ],
    "Джамал"=> [
        "translit"=> "dzhamal",
        "genitive"=> "Джамала",
        "variants"=> [
            "джамал",
            "джамиль",
            "джамаль",
            "джама",
            "джамалик"
        ]
    ],
    "Джамиль"=> [
        "translit"=> "dzhamil",
        "genitive"=> "Джамиля",
        "variants"=> [
            "джамиль",
            "джамилюшка",
            "джамилечка",
            "джамиленька",
            "джамушка",
            "джамуся"
        ]
    ],
    "Диана"=> [
        "translit"=> "diana",
        "genitive"=> "Дианы",
        "variants"=> [
            "диана",
            "дианочка",
            "диечка",
            "диночка"
        ]
    ],
    "Дима"=> [
        "translit"=> "dima",
        "genitive"=> "Димы",
        "variants"=> [
            "дима",
            "дмитрий",
            "димочка",
            "димуля",
            "димуся",
            "митя",
            "митюша"
        ]
    ],
    "Дина"=> [
        "translit"=> "dina",
        "genitive"=> "Дины",
        "variants"=> [
            "дина",
            "диночка"
        ]
    ],
    "Добрыня"=> [
        "translit"=> "dobrynya",
        "genitive"=> "Добрыня",
        "variants"=> [
            "добрыня",
            "добруша",
            "добрынка",
            "добрынюшка",
            "добрынчик"
        ]
    ],
    "Доминика"=> [
        "translit"=> "dominika",
        "genitive"=> "Доминики",
        "variants"=> [
            "доминика"
        ]
    ],
    "Дорофей"=> [
        "translit"=> "dorofej",
        "genitive"=> "Дорофея",
        "variants"=> [
            "дорофей",
            "дорофеюшка",
            "дорофейчик",
            "дорик",
            "дорофейка",
            "дарик"
        ]
    ],
    "Дэвид"=> [
        "translit"=> "devid",
        "genitive"=> "Дэвида",
        "variants"=> [
            "дэвид",
            "давидик",
            "давидушка",
            "давидка",
            "додик"
        ]
    ],
    "Дэниэль"=> [
        "translit"=> "deniel",
        "genitive"=> "Дэниэля",
        "variants"=> [
            "дэниэль",
            "даниэльчик"
        ]
    ],
    "Ева"=> [
        "translit"=> "eva",
        "genitive"=> "Евы",
        "variants"=> [
            "ева",
            "евочка",
            "евонька"
        ]
    ],
    "Евангелина"=> [
        "translit"=> "evangelina",
        "genitive"=> "Евангелины",
        "variants"=> [
            "евангелина",
            "евангелиночка"
        ]
    ],
    "Евгений"=> [
        "translit"=> "evgenij",
        "genitive"=> "Жени",
        "variants"=> [
            "евгений",
            "женя",
            "женечка",
            "евгеньюшка",
            "гешенька",
            "евген",
            "женек"
        ]
    ],
    "Евгения"=> [
        "translit"=> "evgeniya",
        "genitive"=> "Жени",
        "variants"=> [
            "евгения",
            "женя",
            "женечка"
        ]
    ],
    "Евдокия"=> [
        "translit"=> "evdokiya",
        "genitive"=> "Евдокии",
        "variants"=> [
            "евдокия"
        ]
    ],
    "Евпраксия"=> [
        "translit"=> "evpraksiya",
        "genitive"=> "Евпраксии",
        "variants"=> [
            "евпраксия"
        ]
    ],
    "Егор"=> [
        "translit"=> "egor",
        "genitive"=> "Егора",
        "variants"=> [
            "егор",
            "егорушка",
            "егорчик",
            "егорочка",
            "жорочка",
            "жора",
            "егорка"
        ]
    ],
    "Езги"=> [
        "translit"=> "ezgi",
        "genitive"=> "Езги",
        "variants"=> [
            "езги"
        ]
    ],
    "Елисей"=> [
        "translit"=> "elisej",
        "genitive"=> "Елисея",
        "variants"=> [
            "елисей",
            "елисеюшка",
            "елисейчик",
            "лисенок"
        ]
    ],
    "Емельян"=> [
        "translit"=> "emelyan",
        "genitive"=> "Емельяна",
        "variants"=> [
            "емельян",
            "емеля",
            "емелечка",
            "емеленька",
            "емельянушка",
            "емельянчик"
        ]
    ],
    "Еремей"=> [
        "translit"=> "eremej",
        "genitive"=> "Еремея",
        "variants"=> [
            "еремей",
            "еремеюшка",
            "еремейчик"
        ]
    ],
    "Ерофей"=> [
        "translit"=> "erofej",
        "genitive"=> "Ерофея",
        "variants"=> [
            "ерофей",
            "ерофеюшка",
            "ерофейчик"
        ]
    ],
    "Есения"=> [
        "translit"=> "eseniya",
        "genitive"=> "Есении",
        "variants"=> [
            "есения"
        ]
    ],
    "Ефим"=> [
        "translit"=> "efim",
        "genitive"=> "Ефима",
        "variants"=> [
            "ефим",
            "ефимчик",
            "ефимушка",
            "фима",
            "ефимка",
            "фимочка"
        ]
    ],
    "Ефимия"=> [
        "translit"=> "efimiya",
        "genitive"=> "Ефимии",
        "variants"=> [
            "ефимия",
            "фима"
        ]
    ],
    "Ефросиния"=> [
        "translit"=> "efrosiniya",
        "genitive"=> "Ефросинии",
        "variants"=> [
            "ефросиния",
            "фрося",
            "евфросиния",
            "евфросинья",
            "ефросинья"
        ]
    ],
    "Жанна"=> [
        "translit"=> "zhanna",
        "genitive"=> "Жанны",
        "variants"=> [
            "жанна",
            "жанночка"
        ]
    ],
    "Зара"=> [
        "translit"=> "zara",
        "genitive"=> "Зары",
        "variants"=> [
            "зара",
            "зарочка"
        ]
    ],
    "Зарина"=> [
        "translit"=> "zarina",
        "genitive"=> "Зарины",
        "variants"=> [
            "зарина",
            "зариночка"
        ]
    ],
    "Захар"=> [
        "translit"=> "zahar",
        "genitive"=> "Захара",
        "variants"=> [
            "захар",
            "захарка",
            "захарчик",
            "захарушка"
        ]
    ],
    "Зина"=> [
        "translit"=> "zina",
        "genitive"=> "Зины",
        "variants"=> [
            "зина",
            "зинаида",
            "зиначка",
            "зинуля"
        ]
    ],
    "Злата"=> [
        "translit"=> "zlata",
        "genitive"=> "Златы",
        "variants"=> [
            "злата",
            "златочка"
        ]
    ],
    "Зоя"=> [
        "translit"=> "zoya",
        "genitive"=> "Зои",
        "variants"=> [
            "зоя",
            "зоячка"
        ]
    ],
    "Иванна"=> [
        "translit"=> "ivanna",
        "genitive"=> "Иванны",
        "variants"=> [
            "иванна",
            "иванночка"
        ]
    ],
    "Игнат"=> [
        "translit"=> "ignatij",
        "genitive"=> "Игната",
        "variants"=> [
            "игнат",
            "игнаша",
            "игнашечка",
            "игнаточка",
            "игоша",
            "игошенька"
        ]
    ],
    "Игнатий"=> [
        "translit"=> "ignatij",
        "genitive"=> "Игнатия",
        "variants"=> [
            "игнатий",
            "игнаша",
            "игнашечка",
            "игнаточка",
            "игоша",
            "игошенька"
        ]
    ],
    "Игорь"=> [
        "translit"=> "igor",
        "genitive"=> "Игоря",
        "variants"=> [
            "игорь",
            "игорек",
            "игоречек",
            "гоша",
            "гошенька",
            "гога"
        ]
    ],
    "Ида"=> [
        "translit"=> "ida",
        "genitive"=> "Иды",
        "variants"=> [
            "ида",
            "идочка"
        ]
    ],
    "Израиль"=> [
        "translit"=> "izrail",
        "genitive"=> "Израиля",
        "variants"=> [
            "израиль",
            "израйльчик",
            "израилюшка",
            "израил"
        ]
    ],
    "Изяслав"=> [
        "translit"=> "izyaslav",
        "genitive"=> "Изяслава",
        "variants"=> [
            "изяслав",
            "слава",
            "славуша",
            "изяславушка",
            "изяславчик"
        ]
    ],
    "Иисус"=> [
        "translit"=> "iisus",
        "genitive"=> "Иисуса",
        "variants"=> [
            "иисус"
        ]
    ],
    "Илария"=> [
        "translit"=> "ilariya",
        "genitive"=> "Иларии",
        "variants"=> [
            "илария"
        ]
    ],
    "Илларион"=> [
        "translit"=> "illarion",
        "genitive"=> "Иллариона",
        "variants"=> [
            "илларион",
            "иллариончик",
            "илларионушка",
            "ларик",
            "лариоша",
            "лариончик"
        ]
    ],
    "Илона"=> [
        "translit"=> "ilona",
        "genitive"=> "Илоны",
        "variants"=> [
            "илона",
            "илоночка"
        ]
    ],
    "Илья"=> [
        "translit"=> "ilya",
        "genitive"=> "Ильи",
        "variants"=> [
            "илья",
            "ильюша",
            "илюня",
            "иляша",
            "илюша"
        ]
    ],
    "Ильяс"=> [
        "translit"=> "ilyas",
        "genitive"=> "Ильяса",
        "variants"=> [
            "ильяс",
            "ильясик"
        ]
    ],
    "Инга"=> [
        "translit"=> "inga",
        "genitive"=> "Инги",
        "variants"=> [
            "инга",
            "ингуша"
        ]
    ],
    "Инесса"=> [
        "translit"=> "inessa",
        "genitive"=> "Инессы",
        "variants"=> [
            "инесса",
            "инессочка"
        ]
    ],
    "Инна"=> [
        "translit"=> "inna",
        "genitive"=> "Инны",
        "variants"=> [
            "инна",
            "инночка",
            "инуся"
        ]
    ],
    "Иннокентий"=> [
        "translit"=> "innokentij",
        "genitive"=> "Иннокентия",
        "variants"=> [
            "иннокентий",
            "кеша",
            "кешенька",
            "иня",
            "инечка"
        ]
    ],
    "Иосиф"=> [
        "translit"=> "iosif",
        "genitive"=> "Иосифа",
        "variants"=> [
            "иосиф",
            "осенька",
            "ося",
            "еся",
            "иосенька"
        ]
    ],
    "Ира"=> [
        "translit"=> "ira",
        "genitive"=> "Иры",
        "variants"=> [
            "ира",
            "ирина",
            "ирочка",
            "ируся",
            "иришка"
        ]
    ],
    "Ираида"=> [
        "translit"=> "iraida",
        "genitive"=> "Ираиды",
        "variants"=> [
            "ираида"
        ]
    ],
    "Ия"=> [
        "translit"=> "iya",
        "genitive"=> "Ии",
        "variants"=> [
            "ия",
            "иенька",
            "иечка"
        ]
    ],
    "Казимир"=> [
        "translit"=> "kazimir",
        "genitive"=> "Казимира",
        "variants"=> [
            "казимир",
            "казимирчик",
            "казя",
            "казенька",
            "казимирушка"
        ]
    ],
    "Камал"=> [
        "translit"=> "kamal",
        "genitive"=> "Камала",
        "variants"=> [
            "камал",
            "камалушка",
            "камалчик",
            "камальчик"
        ]
    ],
    "Камил"=> [
        "translit"=> "kamil",
        "genitive"=> "Камила",
        "variants"=> [
            "камил",
            "камиль",
            "камилушка",
            "каля",
            "кама"
        ]
    ],
    "Камилла"=> [
        "translit"=> "kamilla",
        "genitive"=> "Камиллы",
        "variants"=> [
            "камилла",
            "камила",
            "камиллочка"
        ]
    ],
    "Карен"=> [
        "translit"=> "karen",
        "genitive"=> "Карена",
        "variants"=> [
            "карен",
            "каренчик",
            "каренушка"
        ]
    ],
    "Карим"=> [
        "translit"=> "karim",
        "genitive"=> "Карима",
        "variants"=> [
            "карим",
            "каримчик",
            "каримушка",
            "каря",
            "карик"
        ]
    ],
    "Карина"=> [
        "translit"=> "karina",
        "genitive"=> "Карины",
        "variants"=> [
            "карина",
            "кариночка"
        ]
    ],
    "Каролина"=> [
        "translit"=> "karolina",
        "genitive"=> "Каролины",
        "variants"=> [
            "каролина",
            "каролиночка"
        ]
    ],
    "Катя"=> [
        "translit"=> "katya",
        "genitive"=> "Кати",
        "variants"=> [
            "катя",
            "екатерина",
            "катенька",
            "катюша",
            "катена"
        ]
    ],
    "Кая"=> [
        "translit"=> "kaya",
        "genitive"=> "Каи",
        "variants"=> [
            "кая",
            "кая"
        ]
    ],
    "Кир"=> [
        "translit"=> "kir",
        "genitive"=> "Кира",
        "variants"=> [
            "кир",
            "кируся",
            "кируня",
            "кируша",
            "кирушка"
        ]
    ],
    "Кира"=> [
        "translit"=> "kira",
        "genitive"=> "Киры",
        "variants"=> [
            "кира",
            "кирочка",
            "кирюша"
        ]
    ],
    "Кирилл"=> [
        "translit"=> "kirill",
        "genitive"=> "Кирилла",
        "variants"=> [
            "кирилл",
            "кирюша",
            "кируша",
            "кирушка",
            "киря",
            "кирочка"
        ]
    ],
    "Клава"=> [
        "translit"=> "klava",
        "genitive"=> "Клавы",
        "variants"=> [
            "клава",
            "клавдия",
            "клавочка"
        ]
    ],
    "Клара"=> [
        "translit"=> "klara",
        "genitive"=> "Клары",
        "variants"=> [
            "клара",
            "кларочка",
            "лара",
            "ларочка"
        ]
    ],
    "Коля"=> [
        "translit"=> "kolya",
        "genitive"=> "Коли",
        "variants"=> [
            "коля",
            "николай",
            "коленька",
            "колечка",
            "колюня",
            "коляша",
            "ник"
        ]
    ],
    "Кормак"=> [
        "translit"=> "kormak",
        "genitive"=> "Кормака",
        "variants"=> [
            "кормак"
        ]
    ],
    "Костя"=> [
        "translit"=> "kostya",
        "genitive"=> "Кости",
        "variants"=> [
            "костя",
            "константин",
            "костик",
            "костенька",
            "костюша",
            "костян"
        ]
    ],
    "Кристиан"=> [
        "translit"=> "kristian",
        "genitive"=> "Кристиана",
        "variants"=> [
            "кристиан",
            "кристя",
            "кристианушка",
            "кристик"
        ]
    ],
    "Кристина"=> [
        "translit"=> "kristina",
        "genitive"=> "Кристины",
        "variants"=> [
            "кристина",
            "кристиночка"
        ]
    ],
    "Ксюша"=> [
        "translit"=> "ksyusha",
        "genitive"=> "Ксюши",
        "variants"=> [
            "ксюша",
            "ксения",
            "ксюшенька",
            "ксюшечка"
        ]
    ],
    "Кузьма"=> [
        "translit"=> "kuzma",
        "genitive"=> "Кузьмы",
        "variants"=> [
            "кузьма",
            "кузька",
            "кузя",
            "кузенька",
            "кузяша"
        ]
    ],
    "Лавр"=> [
        "translit"=> "lavr",
        "genitive"=> "Лавра",
        "variants"=> [
            "лавр",
            "лавруша",
            "лаврушка",
            "лаврентий",
            "лаврик"
        ]
    ],
    "Лада"=> [
        "translit"=> "lada",
        "genitive"=> "Лады",
        "variants"=> [
            "лада",
            "ладочка"
        ]
    ],
    "Лариса"=> [
        "translit"=> "larisa",
        "genitive"=> "Ларисы",
        "variants"=> [
            "лариса",
            "ларисочка",
            "лара",
            "ларочка"
        ]
    ],
    "Лев"=> [
        "translit"=> "lev",
        "genitive"=> "Льва",
        "variants"=> [
            "лев",
            "лева",
            "левушка",
            "лева",
            "левочка",
            "левик"
        ]
    ],
    "Лейсан"=> [
        "translit"=> "lejsan",
        "genitive"=> "Лейсан",
        "variants"=> [
            "лейсан"
        ]
    ],
    "Лена"=> [
        "translit"=> "lena",
        "genitive"=> "Лены",
        "variants"=> [
            "лена",
            "елена",
            "леночка",
            "ленуся",
            "аленка",
            "аленушка"
        ]
    ],
    "Леон"=> [
        "translit"=> "leon",
        "genitive"=> "Леона",
        "variants"=> [
            "леон",
            "леончик",
            "леонушка",
            "ленчик",
            "лео"
        ]
    ],
    "Леонид"=> [
        "translit"=> "leonid",
        "genitive"=> "Леонида",
        "variants"=> [
            "леонид",
            "леня",
            "ленечка",
            "ленчик",
            "ленюся",
            "леонидушка"
        ]
    ],
    "Леопольд"=> [
        "translit"=> "leopold",
        "genitive"=> "Леопольда",
        "variants"=> [
            "леопольд",
            "леопольдик",
            "леопольдушка"
        ]
    ],
    "Лера"=> [
        "translit"=> "lera",
        "genitive"=> "Леры",
        "variants"=> [
            "лера",
            "валерия",
            "лерочка"
        ]
    ],
    "Леся"=> [
        "translit"=> "lesya",
        "genitive"=> "Леси",
        "variants"=> [
            "леся",
            "лесенька"
        ]
    ],
    "Лёша"=> [
        "translit"=> "lesha",
        "genitive"=> "Лёши",
        "variants"=> [
            "леша",
            "алексей",
            "лешенька",
            "алешенька",
            "алеша",
            "леха"
        ]
    ],
    "Лея"=> [
        "translit"=> "leya",
        "genitive"=> "Леи",
        "variants"=> [
            "лея"
        ]
    ],
    "Лиана"=> [
        "translit"=> "liana",
        "genitive"=> "Лианы",
        "variants"=> [
            "лиана",
            "лианочка"
        ]
    ],
    "Лида"=> [
        "translit"=> "lida",
        "genitive"=> "Лиды",
        "variants"=> [
            "лида",
            "лидия",
            "лидочка"
        ]
    ],
    "Лиза"=> [
        "translit"=> "liza",
        "genitive"=> "Лизы",
        "variants"=> [
            "лиза",
            "елизавета",
            "лизочка",
            "лизонька",
            "лизуша",
            "лилечка"
        ]
    ],
    "Лили"=> [
        "translit"=> "lili",
        "genitive"=> "Лили",
        "variants"=> [
            "лили",
            "лиличка"
        ]
    ],
    "Лилия"=> [
        "translit"=> "liliya",
        "genitive"=> "Лилии",
        "variants"=> [
            "лилия",
            "лилечка",
            "лилочка",
            "лиенька"
        ]
    ],
    "Лина"=> [
        "translit"=> "lina",
        "genitive"=> "Лины",
        "variants"=> [
            "лина",
            "линочка"
        ]
    ],
    "Лука"=> [
        "translit"=> "luka",
        "genitive"=> "Луки",
        "variants"=> [
            "лука",
            "лукаша",
            "лукашенька",
            "лукашечка",
            "лукиан"
        ]
    ],
    "Лукьян"=> [
        "translit"=> "lukyan",
        "genitive"=> "Лукьяна",
        "variants"=> [
            "лукьян",
            "лукьянушка",
            "лукьянчик",
            "лука"
        ]
    ],
    "Люба"=> [
        "translit"=> "lyuba",
        "genitive"=> "Любы",
        "variants"=> [
            "люба",
            "любовь",
            "любочка",
            "любаша",
            "любава",
            "люся"
        ]
    ],
    "Люда"=> [
        "translit"=> "lyuda",
        "genitive"=> "Люды",
        "variants"=> [
            "люда",
            "людмила",
            "людочка"
        ]
    ],
    "Магдалина"=> [
        "translit"=> "magdalina",
        "genitive"=> "Магдалины",
        "variants"=> [
            "магдалина",
            "магдалиночка"
        ]
    ],
    "Мадлен"=> [
        "translit"=> "madlen",
        "genitive"=> "Мадлены",
        "variants"=> [
            "мадлен",
            "мадленочка"
        ]
    ],
    "Майя"=> [
        "translit"=> "majya",
        "genitive"=> "Майи",
        "variants"=> [
            "майя",
            "майечка"
        ]
    ],
    "Макар"=> [
        "translit"=> "makar",
        "genitive"=> "Макара",
        "variants"=> [
            "макар",
            "макарушка",
            "макарчик",
            "макаша",
            "макарка",
            "макашенька"
        ]
    ],
    "Максим"=> [
        "translit"=> "maksim",
        "genitive"=> "Максима",
        "variants"=> [
            "максим",
            "макс",
            "максик",
            "максимка",
            "максимчик"
        ]
    ],
    "Максимильян"=> [
        "translit"=> "maksimilyan",
        "genitive"=> "Максимильяна",
        "variants"=> [
            "максимильян",
            "максимильянушка",
            "максимильянчик",
            "максик",
            "макс"
        ]
    ],
    "Маргарита"=> [
        "translit"=> "margarita",
        "genitive"=> "Маргариты",
        "variants"=> [
            "маргарита",
            "марго",
            "маргариточка",
            "маргоша"
        ]
    ],
    "Марианна"=> [
        "translit"=> "marianna",
        "genitive"=> "Марианы",
        "variants"=> [
            "марианна",
            "марианночка"
        ]
    ],
    "Марина"=> [
        "translit"=> "marina",
        "genitive"=> "Марины",
        "variants"=> [
            "марина",
            "мариночка",
            "мариша"
        ]
    ],
    "Марк"=> [
        "translit"=> "mark",
        "genitive"=> "Марка",
        "variants"=> [
            "марк",
            "маркуша",
            "маркушечка",
            "марик"
        ]
    ],
    "Марсель"=> [
        "translit"=> "marsel",
        "genitive"=> "Марселя",
        "variants"=> [
            "марсель",
            "марселька",
            "марселюшка",
            "марс",
            "марся"
        ]
    ],
    "Марта"=> [
        "translit"=> "marta",
        "genitive"=> "Марты",
        "variants"=> [
            "марта",
            "марточка"
        ]
    ],
    "Мартин"=> [
        "translit"=> "martin",
        "genitive"=> "Мартина",
        "variants"=> [
            "мартин",
            "мартиня",
            "мартын",
            "мартюня",
            "мартюха"
        ]
    ],
    "Марфа"=> [
        "translit"=> "marfa",
        "genitive"=> "Марфы",
        "variants"=> [
            "марфа",
            "марфочка",
            "марфуша"
        ]
    ],
    "Марьяна"=> [
        "translit"=> "maryana",
        "genitive"=> "Марьяны",
        "variants"=> [
            "марьяна",
            "марьяша",
            "мартяночка"
        ]
    ],
    "Матвей"=> [
        "translit"=> "matvej",
        "genitive"=> "Матвея",
        "variants"=> [
            "матвей",
            "матвейка",
            "матя",
            "матюха",
            "мотя",
            "матвеюшка"
        ]
    ],
    "Матильда"=> [
        "translit"=> "matilda",
        "genitive"=> "Матильды",
        "variants"=> [
            "матильда",
            "матильдочка"
        ]
    ],
    "Махмуд"=> [
        "translit"=> "mahmud",
        "genitive"=> "Махмуда",
        "variants"=> [
            "махмуд",
            "мухаммад",
            "хамид"
        ]
    ],
    "Маша"=> [
        "translit"=> "masha",
        "genitive"=> "Маши",
        "variants"=> [
            "маша",
            "мария",
            "машенька",
            "маруся",
            "машуня",
            "мариша",
            "манечка",
            "манюта"
        ]
    ],
    "Мая"=> [
        "translit"=> "maya",
        "genitive"=> "Маи",
        "variants"=> [
            "мая",
            "маечка"
        ]
    ],
    "Мелисса"=> [
        "translit"=> "melissa",
        "genitive"=> "Мелиссы",
        "variants"=> [
            "мелисса",
            "мелиссонька"
        ]
    ],
    "Микаэла"=> [
        "translit"=> "mikaela",
        "genitive"=> "Микаэлы",
        "variants"=> [
            "микаэла",
            "микаэлочка"
        ]
    ],
    "Мила"=> [
        "translit"=> "mila",
        "genitive"=> "Милы",
        "variants"=> [
            "мила",
            "милочка"
        ]
    ],
    "Милан"=> [
        "translit"=> "milan",
        "genitive"=> "Милана",
        "variants"=> [
            "милан",
            "миланчик",
            "миланушка",
            "милочка",
            "милушка"
        ]
    ],
    "Милана"=> [
        "translit"=> "milana",
        "genitive"=> "Миланы",
        "variants"=> [
            "милана",
            "миланочка"
        ]
    ],
    "Милена"=> [
        "translit"=> "milena",
        "genitive"=> "Милены",
        "variants"=> [
            "милена",
            "миленочка"
        ]
    ],
    "Милослава"=> [
        "translit"=> "miloslava",
        "genitive"=> "Милославы",
        "variants"=> [
            "милослава"
        ]
    ],
    "Мира"=> [
        "translit"=> "mira",
        "genitive"=> "Миры",
        "variants"=> [
            "мира",
            "мирочка"
        ]
    ],
    "Мирон"=> [
        "translit"=> "miron",
        "genitive"=> "Мирона",
        "variants"=> [
            "мирон",
            "мироша",
            "мирошенька",
            "мирошечка",
            "миронушка"
        ]
    ],
    "Мирослав"=> [
        "translit"=> "miroslav",
        "genitive"=> "Мирослава",
        "variants"=> [
            "мирослав",
            "мирославчик",
            "мирославушка",
            "мир",
            "мирчик",
            "мироша"
        ]
    ],
    "Мирослава"=> [
        "translit"=> "miroslava",
        "genitive"=> "Мирославы",
        "variants"=> [
            "мирослава",
            "слава"
        ]
    ],
    "Митрофан"=> [
        "translit"=> "mitrofan",
        "genitive"=> "Митрофана",
        "variants"=> [
            "митрофан",
            "митроша",
            "митрошка",
            "митрошенька",
            "митя",
            "митрофанчик"
        ]
    ],
    "Михаель"=> [
        "translit"=> "mihael",
        "genitive"=> "Михаэля",
        "variants"=> [
            "михаель",
            "миша",
            "михаэльчик",
            "мишенька",
            "миха"
        ]
    ],
    "Михей"=> [
        "translit"=> "mihej",
        "genitive"=> "Михея",
        "variants"=> [
            "михей",
            "михейчик",
            "михеюшка"
        ]
    ],
    "Миша"=> [
        "translit"=> "misha",
        "genitive"=> "Миши",
        "variants"=> [
            "миша",
            "михаил",
            "мишка",
            "мишутка",
            "мишенька",
            "мишуля",
            "мишаня"
        ]
    ],
    "Мия"=> [
        "translit"=> "miya",
        "genitive"=> "Мии",
        "variants"=> [
            "мия"
        ]
    ],
    "Мстислав"=> [
        "translit"=> "mstislav",
        "genitive"=> "Мстислава",
        "variants"=> [
            "мстислав",
            "мстиша",
            "мстишенька",
            "слава",
            "славик",
            "мстиславчик"
        ]
    ],
    "Мстислава"=> [
        "translit"=> "mstislava",
        "genitive"=> "Мстиславы",
        "variants"=> [
            "мстислава"
        ]
    ],
    "Мурад"=> [
        "translit"=> "murad",
        "genitive"=> "Мурада",
        "variants"=> [
            "мурад",
            "мурад",
            "мурик",
            "мурадик"
        ]
    ],
    "Мурат"=> [
        "translit"=> "murat",
        "genitive"=> "Мурата",
        "variants"=> [
            "мурат",
            "мурат",
            "мурик",
            "муратик"
        ]
    ],
    "Муслим"=> [
        "translit"=> "muslim",
        "genitive"=> "Муслима",
        "variants"=> [
            "муслим",
            "муслимчик",
            "муся",
            "муслимушка"
        ]
    ],
    "Мустафа"=> [
        "translit"=> "mustafa",
        "genitive"=> "Мустафы",
        "variants"=> [
            "мустафа"
        ]
    ],
    "Мухтар"=> [
        "translit"=> "muhtar",
        "genitive"=> "Мухтара",
        "variants"=> [
            "мухтар",
            "мухтарчик",
            "мухтарушка"
        ]
    ],
    "Надя"=> [
        "translit"=> "nadya",
        "genitive"=> "Нади",
        "variants"=> [
            "надя",
            "надежда",
            "наденька",
            "надюша"
        ]
    ],
    "Назар"=> [
        "translit"=> "nazar",
        "genitive"=> "Назара",
        "variants"=> [
            "назар",
            "назарчик",
            "назарушка",
            "зора"
        ]
    ],
    "Настя"=> [
        "translit"=> "nastya",
        "genitive"=> "Насти",
        "variants"=> [
            "настя",
            "анастасия",
            "настенька",
            "настюша",
            "анастаска",
            "стася",
            "тася",
            "ася"
        ]
    ],
    "Натан"=> [
        "translit"=> "natan",
        "genitive"=> "Натана",
        "variants"=> [
            "натан",
            "натанчик",
            "наток",
            "натаник",
            "натаня"
        ]
    ],
    "Натаниэль"=> [
        "translit"=> "nataniel",
        "genitive"=> "Натаниэля",
        "variants"=> [
            "натаниэль",
            "натаниэл",
            "натаниэльчик",
            "натаниэлюшка"
        ]
    ],
    "Наташа"=> [
        "translit"=> "natasha",
        "genitive"=> "Наташи",
        "variants"=> [
            "наташа",
            "наталья",
            "наташенька"
        ]
    ],
    "Наум"=> [
        "translit"=> "naum",
        "genitive"=> "Наума",
        "variants"=> [
            "наум",
            "наумушка",
            "наумчик",
            "ум",
            "умчик"
        ]
    ],
    "Нелли"=> [
        "translit"=> "nelli",
        "genitive"=> "Нелли",
        "variants"=> [
            "нелли",
            "неллечка"
        ]
    ],
    "Нестор"=> [
        "translit"=> "nestor",
        "genitive"=> "Нестора",
        "variants"=> [
            "нестор",
            "несенька",
            "несечка",
            "нестерушка",
            "нестерик",
            "несторушка"
        ]
    ],
    "Нигяр"=> [
        "translit"=> "nigyar",
        "genitive"=> "Нигяр",
        "variants"=> [
            "нигяр"
        ]
    ],
    "Ника"=> [
        "translit"=> "nika",
        "genitive"=> "Ники",
        "variants"=> [
            "ника"
        ]
    ],
    "Никита"=> [
        "translit"=> "nikita",
        "genitive"=> "Никиты",
        "variants"=> [
            "никита",
            "никитка",
            "никитушка",
            "никитенок",
            "никиша",
            "ник"
        ]
    ],
    "Николь"=> [
        "translit"=> "nikol",
        "genitive"=> "Николь",
        "variants"=> [
            "николь"
        ]
    ],
    "Нил"=> [
        "translit"=> "nil",
        "genitive"=> "Нила",
        "variants"=> [
            "нил",
            "нилито",
            "нило",
            "нилинчик"
        ]
    ],
    "Нина"=> [
        "translit"=> "nina",
        "genitive"=> "Нины",
        "variants"=> [
            "нина",
            "ниночка"
        ]
    ],
    "Нинель"=> [
        "translit"=> "ninel",
        "genitive"=> "Нинель",
        "variants"=> [
            "нинель"
        ]
    ],
    "Нора"=> [
        "translit"=> "nora",
        "genitive"=> "Норы",
        "variants"=> [
            "нора",
            "норочка"
        ]
    ],
    "Оксана"=> [
        "translit"=> "oksana",
        "genitive"=> "Оксаны",
        "variants"=> [
            "оксана",
            "оксаночка"
        ]
    ],
    "Олег"=> [
        "translit"=> "oleg",
        "genitive"=> "Олега",
        "variants"=> [
            "олег",
            "олежка",
            "олеженька",
            "олежек",
            "лека"
        ]
    ],
    "Олеся"=> [
        "translit"=> "olesya",
        "genitive"=> "Олеси",
        "variants"=> [
            "олеся",
            "олесечка"
        ]
    ],
    "Оливия"=> [
        "translit"=> "oliviya",
        "genitive"=> "Оливии",
        "variants"=> [
            "оливия"
        ]
    ],
    "Оля"=> [
        "translit"=> "olya",
        "genitive"=> "Оли",
        "variants"=> [
            "оля",
            "ольга",
            "олечка"
        ]
    ],
    "Омар"=> [
        "translit"=> "omar",
        "genitive"=> "Омара",
        "variants"=> [
            "омар",
            "умар",
            "омарчик",
            "омарушка"
        ]
    ],
    "Осип"=> [
        "translit"=> "osip",
        "genitive"=> "Осипа",
        "variants"=> [
            "осип",
            "осенька",
            "ося",
            "оська",
            "осипчик"
        ]
    ],
    "Оскар"=> [
        "translit"=> "oskar",
        "genitive"=> "Оскара",
        "variants"=> [
            "оскар",
            "оса",
            "оска",
            "оскарчик",
            "оскарушка"
        ]
    ],
    "Осман"=> [
        "translit"=> "osman",
        "genitive"=> "Османа",
        "variants"=> [
            "осман",
            "османчик",
            "османушка"
        ]
    ],
    "Павла"=> [
        "translit"=> "pavla",
        "genitive"=> "Павлы",
        "variants"=> [
            "павла",
            "павлуша"
        ]
    ],
    "Парфен"=> [
        "translit"=> "parfyon",
        "genitive"=> "Парфена",
        "variants"=> [
            "парфен",
            "парфенко",
            "парфенушка",
            "парфенчик",
            "парфеша"
        ]
    ],
    "Пахом"=> [
        "translit"=> "pahom",
        "genitive"=> "Пахома",
        "variants"=> [
            "пахом",
            "пахомчик",
            "пахомушка"
        ]
    ],
    "Паша"=> [
        "translit"=> "pasha",
        "genitive"=> "Паши",
        "variants"=> [
            "паша",
            "павел",
            "павлик",
            "павлуша",
            "пашенька",
            "пашуня"
        ]
    ],
    "Пелагея"=> [
        "translit"=> "pelageya",
        "genitive"=> "Пелагеи",
        "variants"=> [
            "пелагея"
        ]
    ],
    "Петя"=> [
        "translit"=> "petya",
        "genitive"=> "Пети",
        "variants"=> [
            "петя",
            "петр",
            "петенька",
            "петечка",
            "петюня",
            "петюша",
            "петруня"
        ]
    ],
    "Платон"=> [
        "translit"=> "platon",
        "genitive"=> "Платона",
        "variants"=> [
            "платон",
            "платоша",
            "платоня",
            "тоня",
            "тоха",
            "тоша"
        ]
    ],
    "Полина"=> [
        "translit"=> "polina",
        "genitive"=> "Полины",
        "variants"=> [
            "полина",
            "полиночка"
        ]
    ],
    "Прасковья"=> [
        "translit"=> "praskovya",
        "genitive"=> "Прасковьи",
        "variants"=> [
            "прасковья"
        ]
    ],
    "Прохор"=> [
        "translit"=> "prohor",
        "genitive"=> "Прохора",
        "variants"=> [
            "прохор",
            "проша",
            "прошенька",
            "прошечка",
            "проня"
        ]
    ],
    "Рада"=> [
        "translit"=> "rada",
        "genitive"=> "Рады",
        "variants"=> [
            "рада",
            "радочка"
        ]
    ],
    "Радель"=> [
        "translit"=> "radel",
        "genitive"=> "Раделя",
        "variants"=> [
            "радель",
            "радельчик",
            "раделюшка"
        ]
    ],
    "Радимир"=> [
        "translit"=> "radimir",
        "genitive"=> "Радимира",
        "variants"=> [
            "радимир",
            "родомир",
            "радик",
            "радмир",
            "радимирчик",
            "радимирушка"
        ]
    ],
    "Радмир"=> [
        "translit"=> "radmir",
        "genitive"=> "Радмира",
        "variants"=> [
            "радмир",
            "родомир",
            "радик",
            "радмир",
            "радмирчик",
            "радмирушка"
        ]
    ],
    "Радмира"=> [
        "translit"=> "radmira",
        "genitive"=> "Радмиры",
        "variants"=> [
            "радмира"
        ]
    ],
    "Рамазан"=> [
        "translit"=> "ramazan",
        "genitive"=> "Рамазана",
        "variants"=> [
            "рамазан",
            "рамазанчик",
            "рамазанушка"
        ]
    ],
    "Ратмир"=> [
        "translit"=> "ratmir",
        "genitive"=> "Ратмира",
        "variants"=> [
            "ратмир",
            "ратмирчик",
            "ратмирушка",
            "ратша"
        ]
    ],
    "Рашид"=> [
        "translit"=> "rashid",
        "genitive"=> "Рашида",
        "variants"=> [
            "рашид",
            "рашидушка",
            "рашидик",
            "рашик"
        ]
    ],
    "Рая"=> [
        "translit"=> "raya",
        "genitive"=> "Раи",
        "variants"=> [
            "рая",
            "раиса",
            "раечка"
        ]
    ],
    "Регина"=> [
        "translit"=> "regina",
        "genitive"=> "Регины",
        "variants"=> [
            "регина",
            "региночка"
        ]
    ],
    "Резо"=> [
        "translit"=> "rezo",
        "genitive"=> "Резо",
        "variants"=> [
            "резо",
            "резончик",
            "резушка",
            "резошка",
            "резотик"
        ]
    ],
    "Ренат"=> [
        "translit"=> "renat",
        "genitive"=> "Рената",
        "variants"=> [
            "ренат",
            "реня",
            "ренечка",
            "ренатушка",
            "ренатик"
        ]
    ],
    "Рената"=> [
        "translit"=> "renata",
        "genitive"=> "Ренаты",
        "variants"=> [
            "рената",
            "ренаточка",
            "ренатушка"
        ]
    ],
    "Риана"=> [
        "translit"=> "riana",
        "genitive"=> "Рианы",
        "variants"=> [
            "риана",
            "рианочка"
        ]
    ],
    "Римма"=> [
        "translit"=> "rimma",
        "genitive"=> "Риммы",
        "variants"=> [
            "римма",
            "риммочка"
        ]
    ],
    "Роберт"=> [
        "translit"=> "robert",
        "genitive"=> "Роберта",
        "variants"=> [
            "роберт",
            "роб",
            "робушка",
            "робик",
            "робертик",
            "робертушка"
        ]
    ],
    "Родион"=> [
        "translit"=> "rodion",
        "genitive"=> "Родиона",
        "variants"=> [
            "родион",
            "родиончик",
            "родионушка",
            "родя",
            "родик",
            "родюшка"
        ]
    ],
    "Роза"=> [
        "translit"=> "roza",
        "genitive"=> "Розы",
        "variants"=> [
            "роза",
            "розалия",
            "розочка"
        ]
    ],
    "Ролан"=> [
        "translit"=> "rolan",
        "genitive"=> "Ролана",
        "variants"=> [
            "ролан",
            "роланчик",
            "роланушка",
            "роланд"
        ]
    ],
    "Рома"=> [
        "translit"=> "roma",
        "genitive"=> "Ромы",
        "variants"=> [
            "рома",
            "роман",
            "ромочка",
            "ромуля",
            "ромаша",
            "ромашка"
        ]
    ],
    "Ростислав"=> [
        "translit"=> "rostislav",
        "genitive"=> "Ростислава",
        "variants"=> [
            "ростислав",
            "ростик",
            "ростя",
            "ростиславчик",
            "слава",
            "славик"
        ]
    ],
    "Ростислава"=> [
        "translit"=> "rostislava",
        "genitive"=> "Ростиславы",
        "variants"=> [
            "ростислава",
            "слава"
        ]
    ],
    "Рубен"=> [
        "translit"=> "ruben",
        "genitive"=> "Рубена",
        "variants"=> [
            "рубен",
            "рубенушка",
            "рубенчик",
            "рубик",
            "рубя"
        ]
    ],
    "Руслан"=> [
        "translit"=> "ruslan",
        "genitive"=> "Руслана",
        "variants"=> [
            "руслан",
            "русланчик",
            "руся",
            "русик",
            "русечка"
        ]
    ],
    "Руслана"=> [
        "translit"=> "ruslana",
        "genitive"=> "Русланы",
        "variants"=> [
            "руслана",
            "русланочка"
        ]
    ],
    "Рустам"=> [
        "translit"=> "rustam",
        "genitive"=> "Рустама",
        "variants"=> [
            "рустам",
            "рустамчик",
            "рустамушка",
            "рустик",
            "рустя"
        ]
    ],
    "Сабина"=> [
        "translit"=> "sabina",
        "genitive"=> "Сабины",
        "variants"=> [
            "сабина",
            "сабиночка"
        ]
    ],
    "Савва"=> [
        "translit"=> "savva",
        "genitive"=> "Саввы",
        "variants"=> [
            "савва",
            "савелий",
            "савушка",
            "савочка",
            "сава",
            "саввонька"
        ]
    ],
    "Савелий"=> [
        "translit"=> "savelij",
        "genitive"=> "Савелия",
        "variants"=> [
            "савелий",
            "сава",
            "савва",
            "савушка",
            "савонька"
        ]
    ],
    "Самира"=> [
        "translit"=> "samira",
        "genitive"=> "Самиры",
        "variants"=> [
            "самира",
            "самирочка"
        ]
    ],
    "Сандро"=> [
        "translit"=> "sandro",
        "genitive"=> "Сандро",
        "variants"=> [
            "сандро",
            "сандрушка",
            "сандрочка"
        ]
    ],
    "Света"=> [
        "translit"=> "sveta",
        "genitive"=> "Светы",
        "variants"=> [
            "света",
            "светлана",
            "светочка",
            "светик"
        ]
    ],
    "Святослав"=> [
        "translit"=> "svyatoslav",
        "genitive"=> "Святослава",
        "variants"=> [
            "святослав",
            "слава",
            "славик",
            "славочка",
            "святославчик",
            "святославушка"
        ]
    ],
    "Севастьян"=> [
        "translit"=> "sevastyan",
        "genitive"=> "Севастьяна",
        "variants"=> [
            "севастьян",
            "сева",
            "севочка",
            "севастьянушка",
            "севастьянчик",
            "севушка"
        ]
    ],
    "Севиль"=> [
        "translit"=> "sevil",
        "genitive"=> "Севиль",
        "variants"=> [
            "севиль"
        ]
    ],
    "Семён"=> [
        "translit"=> "semyon",
        "genitive"=> "Семёна",
        "variants"=> [
            "семен",
            "сема",
            "сеня",
            "сенечка"
        ]
    ],
    "Серафим"=> [
        "translit"=> "serafim",
        "genitive"=> "Серафима",
        "variants"=> [
            "серафим",
            "сима",
            "симочка",
            "симушка",
            "серафимушка",
            "серафимчик"
        ]
    ],
    "Серафима"=> [
        "translit"=> "serafima",
        "genitive"=> "Серафимы",
        "variants"=> [
            "серафима",
            "серафимушка",
            "сима",
            "симочка",
            "симушка"
        ]
    ],
    "Сергей"=> [
        "translit"=> "sergej",
        "genitive"=> "Сергея",
        "variants"=> [
            "сергей",
            "сережа",
            "сереженька",
            "серж",
            "сереженька"
        ]
    ],
    "Вячеслав"=> [
        "translit"=> "vyacheslav",
        "genitive"=> "Славы",
        "variants"=> [
            "вячеслав",
            "вячеслав",
            "славочка",
            "славушка",
            "славик"
        ]
    ],
    "Слава"=> [
        "translit"=> "slava",
        "genitive"=> "Славы",
        "variants"=> [
            "слава",
            "слава",
            "славочка",
            "славушка"
        ]
    ],
    "Снежана"=> [
        "translit"=> "snezhana",
        "genitive"=> "Снежаны",
        "variants"=> [
            "снежана",
            "снежаночка"
        ]
    ],
    "Соломон"=> [
        "translit"=> "solomon",
        "genitive"=> "Соломона",
        "variants"=> [
            "соломон",
            "соломончик",
            "соломонушка"
        ]
    ],
    "София"=> [
        "translit"=> "sofiya",
        "genitive"=> "Софии",
        "variants"=> [
            "софия",
            "соня",
            "софушка",
            "софа",
            "сонечка"
        ]
    ],
    "Софья"=> [
        "translit"=> "sofya",
        "genitive"=> "Софьи",
        "variants"=> [
            "софья",
            "соня",
            "софушка",
            "софа",
            "сонечка"
        ]
    ],
    "Стас"=> [
        "translit"=> "stas",
        "genitive"=> "Стаса",
        "variants"=> [
            "стас",
            "станислав",
            "стасик",
            "слава",
            "станя"
        ]
    ],
    "Стелла"=> [
        "translit"=> "stella",
        "genitive"=> "Стеллы",
        "variants"=> [
            "стелла"
        ]
    ],
    "Стёпа"=> [
        "translit"=> "styopa",
        "genitive"=> "Стёпы",
        "variants"=> [
            "степа",
            "степан",
            "степочка",
            "степушка",
            "степаша"
        ]
    ],
    "Стефания"=> [
        "translit"=> "stefaniya",
        "genitive"=> "Стефании",
        "variants"=> [
            "стефания",
            "стефа"
        ]
    ],
    "Султан"=> [
        "translit"=> "sultan",
        "genitive"=> "Султана",
        "variants"=> [
            "султан",
            "султанчик",
            "султанушка"
        ]
    ],
    "Сусанна"=> [
        "translit"=> "susanna",
        "genitive"=> "Сусанны",
        "variants"=> [
            "сусанна",
            "суссаночка"
        ]
    ],
    "Таисия"=> [
        "translit"=> "taisiya",
        "genitive"=> "Таисии",
        "variants"=> [
            "таисия"
        ]
    ],
    "Тамила"=> [
        "translit"=> "tamila",
        "genitive"=> "Тамилы",
        "variants"=> [
            "тамила",
            "тамилочка"
        ]
    ],
    "Таня"=> [
        "translit"=> "tanya",
        "genitive"=> "Тани",
        "variants"=> [
            "таня",
            "татьяна",
            "танечка",
            "татоша",
            "таточка",
            "таша",
            "ташенька"
        ]
    ],
    "Тарас"=> [
        "translit"=> "taras",
        "genitive"=> "Тараса",
        "variants"=> [
            "тарас",
            "тараска",
            "тарасочка",
            "тарасушка",
            "тараша"
        ]
    ],
    "Теймур"=> [
        "translit"=> "tejmur",
        "genitive"=> "Теймура",
        "variants"=> [
            "теймур"
        ]
    ],
    "Теона"=> [
        "translit"=> "teona",
        "genitive"=> "Теоны",
        "variants"=> [
            "теона",
            "теоночка"
        ]
    ],
    "Тигран"=> [
        "translit"=> "tigran",
        "genitive"=> "Тиграна",
        "variants"=> [
            "тигран"
        ]
    ],
    "Тимофей"=> [
        "translit"=> "timofej",
        "genitive"=> "Тимофея",
        "variants"=> [
            "тимофей",
            "тимоша",
            "тима",
            "тимочка",
            "тимофейка"
        ]
    ],
    "Тимур"=> [
        "translit"=> "timur",
        "genitive"=> "Тимура",
        "variants"=> [
            "тимур",
            "тимурчик",
            "тима",
            "тимурка",
            "тимуша"
        ]
    ],
    "Тихон"=> [
        "translit"=> "tihon",
        "genitive"=> "Тихона",
        "variants"=> [
            "тихон",
            "тиша",
            "тишенька",
            "тихонка",
            "тишечка"
        ]
    ],
    "Толя"=> [
        "translit"=> "tolya",
        "genitive"=> "Толи",
        "variants"=> [
            "толя",
            "анатолий",
            "толик",
            "тольчик",
            "толечка"
        ]
    ],
    "Тома"=> [
        "translit"=> "toma",
        "genitive"=> "Томы",
        "variants"=> [
            "тома",
            "тамара",
            "томочка"
        ]
    ],
    "Трофим"=> [
        "translit"=> "trofim",
        "genitive"=> "Трофима",
        "variants"=> [
            "трофим",
            "фима",
            "трофимка"
        ]
    ],
    "Ульяна"=> [
        "translit"=> "ulyana",
        "genitive"=> "Ульяны",
        "variants"=> [
            "ульяна",
            "уля",
            "ульяночка"
        ]
    ],
    "Ума"=> [
        "translit"=> "uma",
        "genitive"=> "Умы",
        "variants"=> [
            "ума"
        ]
    ],
    "Умар"=> [
        "translit"=> "umar",
        "genitive"=> "Умара",
        "variants"=> [
            "умар"
        ]
    ],
    "Фаина"=> [
        "translit"=> "faina",
        "genitive"=> "Фаины",
        "variants"=> [
            "фаина",
            "фаиночка"
        ]
    ],
    "Фархат"=> [
        "translit"=> "farhat",
        "genitive"=> "Фархата",
        "variants"=> [
            "фархат"
        ]
    ],
    "Федора"=> [
        "translit"=> "fedora",
        "genitive"=> "Федора",
        "variants"=> [
            "федора",
            "федорочка"
        ]
    ],
    "Федя"=> [
        "translit"=> "fedya",
        "genitive"=> "Феди",
        "variants"=> [
            "федя",
            "федор",
            "феденька",
            "федечка",
            "федюня",
            "федяня"
        ]
    ],
    "Феликс"=> [
        "translit"=> "feliks",
        "genitive"=> "Феликса",
        "variants"=> [
            "феликс",
            "фелька",
            "феленька",
            "феля",
            "фелик"
        ]
    ],
    "Феодосия"=> [
        "translit"=> "feodosiya",
        "genitive"=> "Феодосии",
        "variants"=> [
            "феодосия"
        ]
    ],
    "Филипп"=> [
        "translit"=> "filipp",
        "genitive"=> "Филиппа",
        "variants"=> [
            "филипп",
            "филя",
            "филечка",
            "филька",
            "филюша",
            "филиппушка"
        ]
    ],
    "Фома"=> [
        "translit"=> "foma",
        "genitive"=> "Фомы",
        "variants"=> [
            "фома",
            "фомочка",
            "фомка"
        ]
    ],
    "Хаким"=> [
        "translit"=> "hakim",
        "genitive"=> "Хакима",
        "variants"=> [
            "хаким"
        ]
    ],
    "Харитон"=> [
        "translit"=> "hariton",
        "genitive"=> "Харитона",
        "variants"=> [
            "харитон",
            "харитоша",
            "харитонка",
            "харитонушка"
        ]
    ],
    "Цезарь"=> [
        "translit"=> "czezar",
        "genitive"=> "Цезаря",
        "variants"=> [
            "цезарь",
            "цезарчик",
            "зарик"
        ]
    ],
    "Эвелина"=> [
        "translit"=> "evelina",
        "genitive"=> "Эвелины",
        "variants"=> [
            "эвелина",
            "эвелиночка"
        ]
    ],
    "Эвридика"=> [
        "translit"=> "evridika",
        "genitive"=> "Эвридики",
        "variants"=> [
            "эвридика"
        ]
    ],
    "Эдгар"=> [
        "translit"=> "edgar",
        "genitive"=> "Эдгара",
        "variants"=> [
            "эдгар",
            "эдик",
            "эдгарка",
            "эдгарчик",
            "одгер"
        ]
    ],
    "Эдуард"=> [
        "translit"=> "eduard",
        "genitive"=> "Эдуарда",
        "variants"=> [
            "эдуард",
            "эдик",
            "эдюша",
            "эдечка"
        ]
    ],
    "Элеонора"=> [
        "translit"=> "eleonora",
        "genitive"=> "Элеоноры",
        "variants"=> [
            "элеонора",
            "элеонорочка"
        ]
    ],
    "Элиаз"=> [
        "translit"=> "eliaz",
        "genitive"=> "Элиаз",
        "variants"=> [
            "элиаз"
        ]
    ],
    "Эльвира"=> [
        "translit"=> "elvira",
        "genitive"=> "Эльвиры",
        "variants"=> [
            "эльвира",
            "эльвирочка",
            "элика"
        ]
    ],
    "Эльдар"=> [
        "translit"=> "eldar",
        "genitive"=> "Эльдара",
        "variants"=> [
            "эльдар",
            "эльдарчик",
            "эльдарик",
            "эик"
        ]
    ],
    "Эльза"=> [
        "translit"=> "elza",
        "genitive"=> "Эльзы",
        "variants"=> [
            "эльза"
        ]
    ],
    "Эльмира"=> [
        "translit"=> "elmira",
        "genitive"=> "Эльмиры",
        "variants"=> [
            "эльмира",
            "эльмирочка"
        ]
    ],
    "Эмили"=> [
        "translit"=> "emili",
        "genitive"=> "Эмилии",
        "variants"=> [
            "эмили"
        ]
    ],
    "Эмилия"=> [
        "translit"=> "emiliya",
        "genitive"=> "Эмилии",
        "variants"=> [
            "эмилия"
        ]
    ],
    "Эмиль"=> [
        "translit"=> "emil",
        "genitive"=> "Эмиля",
        "variants"=> [
            "эмиль",
            "эмиля",
            "миля",
            "эмилюша",
            "эмилик"
        ]
    ],
    "Эмма"=> [
        "translit"=> "emma",
        "genitive"=> "Эммы",
        "variants"=> [
            "эмма",
            "эммочка"
        ]
    ],
    "Эммануил"=> [
        "translit"=> "emmanuil",
        "genitive"=> "Эммануила",
        "variants"=> [
            "эммануил",
            "моня",
            "эма",
            "има",
            "ила"
        ]
    ],
    "Эренест"=> [
        "translit"=> "erenest",
        "genitive"=> "Эренеста",
        "variants"=> [
            "эренест",
            "эря",
            "эня",
            "эник"
        ]
    ],
    "Эрик"=> [
        "translit"=> "erik",
        "genitive"=> "Эрика",
        "variants"=> [
            "эрик"
        ]
    ],
    "Эрика"=> [
        "translit"=> "erika",
        "genitive"=> "Эрики",
        "variants"=> [
            "эрика"
        ]
    ],
    "Эрнест"=> [
        "translit"=> "ernest",
        "genitive"=> "Эрнеста",
        "variants"=> [
            "эрнест",
            "эря",
            "эня",
            "эник"
        ]
    ],
    "Эстель"=> [
        "translit"=> "estel",
        "genitive"=> "Эстель",
        "variants"=> [
            "эстель"
        ]
    ],
    "Юлиана"=> [
        "translit"=> "yuliana",
        "genitive"=> "Юлианы",
        "variants"=> [
            "юлиана",
            "юлианочка"
        ]
    ],
    "Юля"=> [
        "translit"=> "yulya",
        "genitive"=> "Юли",
        "variants"=> [
            "юля",
            "юлия",
            "юленька",
            "юльчик"
        ]
    ],
    "Юна"=> [
        "translit"=> "yuna",
        "genitive"=> "Юны",
        "variants"=> [
            "юна",
            "юночка",
            "юня"
        ]
    ],
    "Юнона"=> [
        "translit"=> "yunona",
        "genitive"=> "Юноны",
        "variants"=> [
            "юнона",
            "юноночка"
        ]
    ],
    "Юра"=> [
        "translit"=> "yura",
        "genitive"=> "Юры",
        "variants"=> [
            "юра",
            "юрий",
            "юрочка",
            "юронька",
            "юрик",
            "юраня"
        ]
    ],
    "Ядвига"=> [
        "translit"=> "yadviga",
        "genitive"=> "Ядвиги",
        "variants"=> [
            "ядвига"
        ]
    ],
    "Яков"=> [
        "translit"=> "yasha",
        "genitive"=> "Якова",
        "variants"=> [
            "яков",
            "яша",
            "яшенька",
            "якуша"
        ]
    ],
    "Ян"=> [
        "translit"=> "yan",
        "genitive"=> "Яна",
        "variants"=> [
            "ян",
            "яник",
            "янчик",
            "янечка"
        ]
    ],
    "Яна"=> [
        "translit"=> "yana",
        "genitive"=> "Яны",
        "variants"=> [
            "яна",
            "яночка"
        ]
    ],
    "Яромир"=> [
        "translit"=> "yaromir",
        "genitive"=> "Яромира",
        "variants"=> [
            "яромир",
            "ярик",
            "ярочка"
        ]
    ],
    "Ярослав"=> [
        "translit"=> "yaroslav",
        "genitive"=> "Ярослава",
        "variants"=> [
            "ярослав",
            "слава",
            "славик",
            "яречка",
            "ярославка"
        ]
    ],
    "Ярослава"=> [
        "translit"=> "yaroslava",
        "genitive"=> "Ярославы",
        "variants"=> [
            "ярослава",
            "слава"
        ]
    ],
    "Яша"=> [
        "translit"=> "yasha",
        "genitive"=> "Яши",
        "variants"=> [
            "яша",
            "яшенька",
            "яшута",
            "яшуня",
            "якуша"
        ]
    ],
    "Арифметикон"=> [
        "translit"=> "arifmetikon",
        "genitive"=> "Арифметикона",
        "variants"=> [
            "арифметикон"
        ]
    ],
    "Артемий"=> [
        "translit"=> "artemij",
        "genitive"=> "Артемия",
        "variants"=> [
            "артемий"
        ]
    ],
    "Азамат"=> [
        "translit"=> "azamat",
        "genitive"=> "Азамата",
        "variants"=> [
            "азамат"
        ]
    ],
    "Билл"=> [
        "translit"=> "bill",
        "genitive"=> "Билла",
        "variants"=> [
            "билл"
        ]
    ],
    "Дариан"=> [
        "translit"=> "darian",
        "genitive"=> "Дариана",
        "variants"=> [
            "дариан"
        ]
    ],
    "Добромир"=> [
        "translit"=> "dobromir",
        "genitive"=> "Добромира",
        "variants"=> [
            "добромир"
        ]
    ],
    "Эльбрус"=> [
        "translit"=> "elbrus",
        "genitive"=> "Эльбруса",
        "variants"=> [
            "эльбрус"
        ]
    ],
    "Эмир"=> [
        "translit"=> "emir",
        "genitive"=> "Эмира",
        "variants"=> [
            "эмир"
        ]
    ],
    "Луис"=> [
        "translit"=> "luis",
        "genitive"=> "Луиса",
        "variants"=> [
            "луис"
        ]
    ],
    "Ляман"=> [
        "translit"=> "lyaman",
        "genitive"=> "Лямана",
        "variants"=> [
            "ляман"
        ]
    ],
    "Магамед"=> [
        "translit"=> "magamed",
        "genitive"=> "Магамеда",
        "variants"=> [
            "магамед"
        ]
    ],
    "Марат"=> [
        "translit"=> "marat",
        "genitive"=> "Марата",
        "variants"=> [
            "марат"
        ]
    ],
    "Марьям"=> [
        "translit"=> "marjyam",
        "genitive"=> "Марьям",
        "variants"=> [
            "марьям",
            "мариам"
        ]
    ],
    "Олоф"=> [
        "translit"=> "olof",
        "genitive"=> "Олофа",
        "variants"=> [
            "олоф"
        ]
    ],
    "Пламен"=> [
        "translit"=> "plamen",
        "genitive"=> "Пламена",
        "variants"=> [
            "пламен"
        ]
    ],
    "Радион"=> [
        "translit"=> "radion",
        "genitive"=> "Радиона",
        "variants"=> [
            "радион"
        ]
    ],
    "Руфат"=> [
        "translit"=> "rufat",
        "genitive"=> "Руфата",
        "variants"=> [
            "руфат"
        ]
    ],
    "Самсон"=> [
        "translit"=> "samson",
        "genitive"=> "Самсона",
        "variants"=> [
            "самсон"
        ]
    ],
    "Стефан"=> [
        "translit"=> "stefan",
        "genitive"=> "Стефана",
        "variants"=> [
            "стефан"
        ]
    ],
    "Вацлав"=> [
        "translit"=> "vaczlav",
        "genitive"=> "Вацлава",
        "variants"=> [
            "вацлав"
        ]
    ],
    "Алие"=> [
        "translit"=> "alie",
        "genitive"=> "Алии",
        "variants"=> [
            "алие"
        ]
    ],
    "Ани"=> [
        "translit"=> "ani",
        "genitive"=> "Ани",
        "variants"=> [
            "ани"
        ]
    ],
    "Ариадна"=> [
        "translit"=> "ariadna",
        "genitive"=> "Ариадны",
        "variants"=> [
            "ариадна"
        ]
    ],
    "Динара"=> [
        "translit"=> "dinara",
        "genitive"=> "Динары",
        "variants"=> [
            "динара",
            "диночка"
        ]
    ],
    "Элиза"=> [
        "translit"=> "eliza",
        "genitive"=> "Элизы",
        "variants"=> [
            "элиза",
            "элизонька"
        ]
    ],
    "Элизабетт"=> [
        "translit"=> "elizabett",
        "genitive"=> "Элизабетт",
        "variants"=> [
            "элизабетт",
            "элизабет"
        ]
    ],
    "Искра"=> [
        "translit"=> "iskra",
        "genitive"=> "Искры",
        "variants"=> [
            "искра",
            "искорка"
        ]
    ],
    "Жасмин"=> [
        "translit"=> "zhasmin",
        "genitive"=> "Жасмин",
        "variants"=> [
            "жасмин"
        ]
    ],
    "Лейла"=> [
        "translit"=> "lejla",
        "genitive"=> "Лейлы",
        "variants"=> [
            "лейла"
        ]
    ],
    "Лилит"=> [
        "translit"=> "lilit",
        "genitive"=> "Лилит",
        "variants"=> [
            "лилит",
            "лика",
            "ликуся"
        ]
    ],
    "Мариам"=> [
        "translit"=> "mariam",
        "genitive"=> "Мариам",
        "variants"=> [
            "мариам"
        ]
    ],
    "Маруся"=> [
        "translit"=> "marusya",
        "genitive"=> "Маруси",
        "variants"=> [
            "маруся"
        ]
    ],
    "Надиля"=> [
        "translit"=> "nadilya",
        "genitive"=> "Надили",
        "variants"=> [
            "надиля"
        ]
    ],
    "Назиля"=> [
        "translit"=> "nazilya",
        "genitive"=> "Назили",
        "variants"=> [
            "назиля"
        ]
    ],
    "Нонна"=> [
        "translit"=> "nonna",
        "genitive"=> "Нонны",
        "variants"=> [
            "нонна",
            "нонночка"
        ]
    ],
    "Рапсиме"=> [
        "translit"=> "rapsime",
        "genitive"=> "Рапсиме",
        "variants"=> [
            "рапсиме"
        ]
    ],
    "Сузанна"=> [
        "translit"=> "suzanna",
        "genitive"=> "Сузанны",
        "variants"=> [
            "сузанна"
        ]
    ],
    "Зулейха"=> [
        "translit"=> "zulejha",
        "genitive"=> "Зулейхи",
        "variants"=> [
            "зулейха"
        ]
    ],
    "Александрина"=> [
        "translit"=> "alexandrina",
        "genitive"=> "Александрины",
        "variants"=> [
            "александрина"
        ]
    ],
    "Арсения"=> [
        "translit"=> "arseniya",
        "genitive"=> "Арсении",
        "variants"=> [
            "арсения"
        ]
    ],
    "Арзу"=> [
        "translit"=> "arzy",
        "genitive"=> "Арзу",
        "variants"=> [
            "арзу"
        ]
    ],
    "Аурелия"=> [
        "translit"=> "aureliya",
        "genitive"=> "Аурелии",
        "variants"=> [
            "аурелия"
        ]
    ],
    "Даяна"=> [
        "translit"=> "dayana",
        "genitive"=> "Даяны",
        "variants"=> [
            "даяна"
        ]
    ],
    "Елисавета"=> [
        "translit"=> "elisaveta",
        "genitive"=> "Елисаветы",
        "variants"=> [
            "елисавета"
        ]
    ],
    "Эльвина"=> [
        "translit"=> "elvina",
        "genitive"=> "Эльвины",
        "variants"=> [
            "эльвина"
        ]
    ],
    "Феония"=> [
        "translit"=> "feoniya",
        "genitive"=> "Феонии",
        "variants"=> [
            "феония"
        ]
    ],
    "Ирада"=> [
        "translit"=> "irada",
        "genitive"=> "Ирады",
        "variants"=> [
            "ирада"
        ]
    ],
    "Изабелла"=> [
        "translit"=> "izabella",
        "genitive"=> "Изабеллы",
        "variants"=> [
            "изабелла"
        ]
    ],
    "Джулия"=> [
        "translit"=> "dzhuliya",
        "genitive"=> "Джулии",
        "variants"=> [
            "джулия"
        ]
    ],
    "Лаура"=> [
        "translit"=> "laura",
        "genitive"=> "Лауры",
        "variants"=> [
            "лаура"
        ]
    ],
    "Линда"=> [
        "translit"=> "linda",
        "genitive"=> "Линды",
        "variants"=> [
            "линда"
        ]
    ],
    "Лиса"=> [
        "translit"=> "lisa",
        "genitive"=> "Лисы",
        "variants"=> [
            "лиса"
        ]
    ],
    "Сати"=> [
        "translit"=> "sati",
        "genitive"=> "Сати",
        "variants"=> [
            "сати"
        ]
    ],
    "Варя"=> [
        "translit"=> "varya",
        "genitive"=> "Вари",
        "variants"=> [
            "варя"
        ]
    ],
    "Вивиана"=> [
        "translit"=> "viviana",
        "genitive"=> "Вивианы",
        "variants"=> [
            "вивиана"
        ]
    ],
    "Адриана"=> [
        "translit"=> "adriana",
        "genitive"=> "Адрианы",
        "variants"=> [
            "адриана"
        ]
    ],
    "Адьян"=> [
        "translit"=> "adjyan",
        "genitive"=> "Адьяна",
        "variants"=> [
            "адьян"
        ]
    ],
    "Айнур"=> [
        "translit"=> "ainur",
        "genitive"=> "Айнура",
        "variants"=> [
            "айнур"
        ]
    ],
    "Акоп"=> [
        "translit"=> "akop",
        "genitive"=> "Акопа",
        "variants"=> [
            "акоп"
        ]
    ],
    "Алекс"=> [
        "translit"=> "aleks",
        "genitive"=> "Алекса",
        "variants"=> [
            "алекс"
        ]
    ],
    "Альфред"=> [
        "translit"=> "alfred",
        "genitive"=> "Альфреда",
        "variants"=> [
            "альфред"
        ]
    ],
    "Амир"=> [
        "translit"=> "amir",
        "genitive"=> "Амира",
        "variants"=> [
            "амир"
        ]
    ],
    "Андраник"=> [
        "translit"=> "andranik",
        "genitive"=> "Андраника",
        "variants"=> [
            "андраник"
        ]
    ],
    "Ануш"=> [
        "translit"=> "anush",
        "genitive"=> "Ануш",
        "variants"=> [
            "ануш"
        ]
    ],
    "Булат"=> [
        "translit"=> "bulat",
        "genitive"=> "Булата",
        "variants"=> [
            "булат"
        ]
    ],
    "Эльмир"=> [
        "translit"=> "elmir",
        "genitive"=> "Эльмира",
        "variants"=> [
            "эльмир"
        ]
    ],
    "Гавриил"=> [
        "translit"=> "gavriil",
        "genitive"=> "Гавриила",
        "variants"=> [
            "гавриил"
        ]
    ],
    "Геворг"=> [
        "translit"=> "gevorg",
        "genitive"=> "Геворга",
        "variants"=> [
            "геворг"
        ]
    ],
    "Левон"=> [
        "translit"=> "levon",
        "genitive"=> "Левона",
        "variants"=> [
            "левон"
        ]
    ],
    "Майкл"=> [
        "translit"=> "majkl",
        "genitive"=> "Майкла",
        "variants"=> [
            "майкл"
        ]
    ],
    "Мунир"=> [
        "translit"=> "munir",
        "genitive"=> "Мунира",
        "variants"=> [
            "мунир"
        ]
    ],
    "Наиль"=> [
        "translit"=> "nail",
        "genitive"=> "Наиля",
        "variants"=> [
            "наиль"
        ]
    ],
    "Нильс"=> [
        "translit"=> "nils",
        "genitive"=> "Нильса",
        "variants"=> [
            "нильс"
        ]
    ],
    "Олаф"=> [
        "translit"=> "olaf",
        "genitive"=> "Олафа",
        "variants"=> [
            "олаф"
        ]
    ],
    "Ованес"=> [
        "translit"=> "ovanes",
        "genitive"=> "Ованеса",
        "variants"=> [
            "ованес"
        ]
    ],
    "Сева"=> [
        "translit"=> "seva",
        "genitive"=> "Севы",
        "variants"=> [
            "сева"
        ]
    ],
    "Тахир"=> [
        "translit"=> "tahir",
        "genitive"=> "Тахира",
        "variants"=> [
            "тахир"
        ]
    ],
    "Талиб"=> [
        "translit"=> "talib",
        "genitive"=> "Талиба",
        "variants"=> [
            "талиб"
        ]
    ],
    "Вазген"=> [
        "translit"=> "vazgen",
        "genitive"=> "Вазгена",
        "variants"=> [
            "вазген"
        ]
    ],
    "Влад"=> [
        "translit"=> "vlad",
        "genitive"=> "Влада",
        "variants"=> [
            "влад"
        ]
    ],
    "Жора"=> [
        "translit"=> "zhora",
        "genitive"=> "Жоры",
        "variants"=> [
            "жора"
        ]
    ],
    "Иаков"=> [
        "translit"=> "iakov",
        "genitive"=> "Иакова",
        "variants"=> [
            "иаков"
        ]
    ],
    "Илия"=> [
        "translit"=> "iliya",
        "genitive"=> "Илии",
        "variants"=> [
            "илия"
        ]
    ],
    "Абулхаир"=> [
        "translit"=> "abulhair",
        "genitive"=> "Абулхаира",
        "variants"=> [
            "абулхаир"
        ]
    ],
    "Айдар"=> [
        "translit"=> "ajdar",
        "genitive"=> "Айдара",
        "variants"=> [
            "айдар"
        ]
    ],
    "Алан"=> [
        "translit"=> "alan",
        "genitive"=> "Алана",
        "variants"=> [
            "алан"
        ]
    ],
    "Амин"=> [
        "translit"=> "amin",
        "genitive"=> "Амина",
        "variants"=> [
            "амин"
        ]
    ],
    "Анис"=> [
        "translit"=> "anis",
        "genitive"=> "Аниса",
        "variants"=> [
            "анис"
        ]
    ],
    "Арен"=> [
        "translit"=> "aren",
        "genitive"=> "Арена",
        "variants"=> [
            "арен"
        ]
    ],
    "Арон"=> [
        "translit"=> "aron",
        "genitive"=> "Арона",
        "variants"=> [
            "арон"
        ]
    ],
    "Ашхен"=> [
        "translit"=> "ashhen",
        "genitive"=> "Ашхена",
        "variants"=> [
            "ашхен"
        ]
    ],
    "Азат"=> [
        "translit"=> "azat",
        "genitive"=> "Азата",
        "variants"=> [
            "азат"
        ]
    ],
    "Бадри"=> [
        "translit"=> "badri",
        "genitive"=> "Бадри",
        "variants"=> [
            "бадри"
        ]
    ],
    "Дариуш"=> [
        "translit"=> "dariush",
        "genitive"=> "Дариуш",
        "variants"=> [
            "дариуш"
        ]
    ],
    "Эдем"=> [
        "translit"=> "edem",
        "genitive"=> "Эдема",
        "variants"=> [
            "эдем"
        ]
    ],
    "Хайни"=> [
        "translit"=> "hajni",
        "genitive"=> "Хайни",
        "variants"=> [
            "хайни"
        ]
    ],
    "Ибрагим"=> [
        "translit"=> "ibragim",
        "genitive"=> "Ибрагима",
        "variants"=> [
            "ибрагим"
        ]
    ],
    "Ираклий"=> [
        "translit"=> "iraklij",
        "genitive"=> "Ираклия",
        "variants"=> [
            "ираклий"
        ]
    ],
    "Ислам"=> [
        "translit"=> "islam",
        "genitive"=> "Ислама",
        "variants"=> [
            "ислам"
        ]
    ],
    "Клим"=> [
        "translit"=> "klim",
        "genitive"=> "Клима",
        "variants"=> [
            "клим"
        ]
    ],
    "Крис"=> [
        "translit"=> "kris",
        "genitive"=> "Криса",
        "variants"=> [
            "крис"
        ]
    ],
    "Лен"=> [
        "translit"=> "len",
        "genitive"=> "Лена",
        "variants"=> [
            "лен"
        ]
    ],
    "Лео"=> [
        "translit"=> "leo",
        "genitive"=> "Лео",
        "variants"=> [
            "лео"
        ]
    ],
    "Леонэль"=> [
        "translit"=> "leonel",
        "genitive"=> "Леонэля",
        "variants"=> [
            "леонэль"
        ]
    ],
    "Лукас"=> [
        "translit"=> "lukas",
        "genitive"=> "Лукаса",
        "variants"=> [
            "лукас"
        ]
    ],
    "Малик"=> [
        "translit"=> "malik",
        "genitive"=> "Малика",
        "variants"=> [
            "малик"
        ]
    ],
    "Мигель"=> [
        "translit"=> "migel",
        "genitive"=> "Мигеля",
        "variants"=> [
            "мигель"
        ]
    ],
    "Микаэль"=> [
        "translit"=> "mikael",
        "genitive"=> "Микаэля",
        "variants"=> [
            "микаэль"
        ]
    ],
    "Мирам"=> [
        "translit"=> "miram",
        "genitive"=> "Мирама",
        "variants"=> [
            "мирам"
        ]
    ],
    "Митя"=> [
        "translit"=> "mitya",
        "genitive"=> "Мити",
        "variants"=> [
            "митя"
        ]
    ],
    "Моисей"=> [
        "translit"=> "moisej",
        "genitive"=> "Моисея",
        "variants"=> [
            "моисей"
        ]
    ],
    "Нарек"=> [
        "translit"=> "narek",
        "genitive"=> "Нарека",
        "variants"=> [
            "нарек"
        ]
    ],
    "Рафаэль"=> [
        "translit"=> "rafael",
        "genitive"=> "Рафаэль",
        "variants"=> [
            "рафаэль"
        ]
    ],
    "Райен"=> [
        "translit"=> "rajen",
        "genitive"=> "Райена",
        "variants"=> [
            "райен"
        ]
    ],
    "Расул"=> [
        "translit"=> "rasul",
        "genitive"=> "Расула",
        "variants"=> [
            "расул"
        ]
    ],
    "Салават"=> [
        "translit"=> "salavat",
        "genitive"=> "Салавата",
        "variants"=> [
            "салават"
        ]
    ],
    "Солмаз"=> [
        "translit"=> "solmaz",
        "genitive"=> "Солмаза",
        "variants"=> [
            "солмаз"
        ]
    ],
    "Сальвадор"=> [
        "translit"=> "salvador",
        "genitive"=> "Сальвадора",
        "variants"=> [
            "сальвадор"
        ]
    ],
    "Тамука"=> [
        "translit"=> "tamuka",
        "genitive"=> "Тамука",
        "variants"=> [
            "тамука"
        ]
    ],
    "Янис"=> [
        "translit"=> "yanis",
        "genitive"=> "Яниса",
        "variants"=> [
            "янис"
        ]
    ],
    "Заки"=> [
        "translit"=> "zaki",
        "genitive"=> "Заки",
        "variants"=> [
            "заки"
        ]
    ],
    "Алана"=> [
        "translit"=> "alana",
        "genitive"=> "Аланы",
        "variants"=> [
            "алана",
            "аланочка"
        ]
    ],
    "Алия"=> [
        "translit"=> "aliya",
        "genitive"=> "Алии",
        "variants"=> [
            "алия"
        ]
    ],
    "Альмира"=> [
        "translit"=> "almira",
        "genitive"=> "Альмиры",
        "variants"=> [
            "альмира"
        ]
    ],
    "Арианна"=> [
        "translit"=> "arianna",
        "genitive"=> "Арианны",
        "variants"=> [
            "арианна",
            "арианочка"
        ]
    ],
    "Аяна"=> [
        "translit"=> "ayana",
        "genitive"=> "Аяны",
        "variants"=> [
            "аяна"
        ]
    ],
    "Азиза"=> [
        "translit"=> "aziza",
        "genitive"=> "Азизы",
        "variants"=> [
            "азиза"
        ]
    ],
    "Белла"=> [
        "translit"=> "bella",
        "genitive"=> "Беллы",
        "variants"=> [
            "белла"
        ]
    ],
    "Дая"=> [
        "translit"=> "daya",
        "genitive"=> "Даи",
        "variants"=> [
            "дая"
        ]
    ],
    "Элина"=> [
        "translit"=> "elina",
        "genitive"=> "Элины",
        "variants"=> [
            "элина",
            "элиночка"
        ]
    ],
    "Фатима"=> [
        "translit"=> "fatima",
        "genitive"=> "Фатимы",
        "variants"=> [
            "фатима",
            "фатимушка"
        ]
    ],
    "Франческа"=> [
        "translit"=> "franczeska",
        "genitive"=> "Франчески",
        "variants"=> [
            "франческа"
        ]
    ],
    "Хамза"=> [
        "translit"=> "hamza",
        "genitive"=> "Хамзы",
        "variants"=> [
            "хамза"
        ]
    ],
    "Хана"=> [
        "translit"=> "hana",
        "genitive"=> "Ханы",
        "variants"=> [
            "хана",
            "ханна"
        ]
    ],
    "Ива"=> [
        "translit"=> "iva",
        "genitive"=> "Ивы",
        "variants"=> [
            "ива"
        ]
    ],
    "Дженифер"=> [
        "translit"=> "dzhenifer",
        "genitive"=> "Дженифер",
        "variants"=> [
            "дженифер"
        ]
    ],
    "Джесика"=> [
        "translit"=> "dzhesika",
        "genitive"=> "Джесики",
        "variants"=> [
            "джесика"
        ]
    ],
    "Кимберли"=> [
        "translit"=> "kimberli",
        "genitive"=> "Кимберли",
        "variants"=> [
            "кимберли"
        ]
    ],
    "Лара"=> [
        "translit"=> "lara",
        "genitive"=> "Лары",
        "variants"=> [
            "лара",
            "ларочка"
        ]
    ],
    "Лукерия"=> [
        "translit"=> "lukeriya",
        "genitive"=> "Лукерии",
        "variants"=> [
            "лукерия"
        ]
    ],
    "Мадина"=> [
        "translit"=> "madina",
        "genitive"=> "Мадины",
        "variants"=> [
            "мадина"
        ]
    ],
    "Малика"=> [
        "translit"=> "malilka",
        "genitive"=> "Малики",
        "variants"=> [
            "малика"
        ]
    ],
    "Мирра"=> [
        "translit"=> "mirra",
        "genitive"=> "Мирры",
        "variants"=> [
            "мирра",
            "мира"
        ]
    ],
    "Патрисия"=> [
        "translit"=> "patrisiya",
        "genitive"=> "Патрисии",
        "variants"=> [
            "патрисия"
        ]
    ],
    "Сабрина"=> [
        "translit"=> "sabrina",
        "genitive"=> "Сабрины",
        "variants"=> [
            "сабрина"
        ]
    ],
    "Тая"=> [
        "translit"=> "taya",
        "genitive"=> "Таи",
        "variants"=> [
            "тая"
        ]
    ],
    "Ясмина"=> [
        "translit"=> "yasmina",
        "genitive"=> "Ясмины",
        "variants"=> [
            "ясмина"
        ]
    ],
    "Ионна"=> [
        "translit"=> "ionna",
        "genitive"=> "Ионны",
        "variants"=> [
            "ионна"
        ]
    ],
    "Мидина"=> [
        "translit"=> "midina",
        "genitive"=> "Мидины",
        "variants"=> [
            "мидина"
        ]
    ],
    "Нехама"=> [
        "translit"=> "nehama",
        "genitive"=> "Нехамы",
        "variants"=> [
            "нехама"
        ]
    ],
    "Ниа"=> [
        "translit"=> "nia",
        "genitive"=> "Нии",
        "variants"=> [
            "ниа"
        ]
    ],
    "Ясмин"=> [
        "translit"=> "yasmin",
        "genitive"=> "Ясмины",
        "variants"=> [
            "ясмин"
        ]
    ],
    "Эстер"=> [
        "translit"=> "ester",
        "genitive"=> "Эстер",
        "variants"=> [
            "эстер"
        ]
    ],
    "Флора"=> [
        "translit"=> "flora",
        "genitive"=> "Флоры",
        "variants"=> [
            "флора"
        ]
    ],
    "Гая"=> [
        "translit"=> "gaya",
        "genitive"=> "Гаи",
        "variants"=> [
            "гая"
        ]
    ],
    "Ивана"=> [
        "translit"=> "ivana",
        "genitive"=> "Иваны",
        "variants"=> [
            "ивана"
        ]
    ],
    "Лиам"=> [
        "translit"=> "liam",
        "genitive"=> "Лиам",
        "variants"=> [
            "лиам"
        ]
    ],
    "Мишель"=> [
        "translit"=> "mishel-w",
        "genitive"=> "Мишель",
        "variants"=> [
            "мишель"
        ]
    ],
    "Петра"=> [
        "translit"=> "petra",
        "genitive"=> "Петры",
        "variants"=> [
            "петра"
        ]
    ],
    "Сагдиана"=> [
        "translit"=> "sagdiana",
        "genitive"=> "Сагдианы",
        "variants"=> [
            "сагдиана"
        ]
    ],
    "Саги"=> [
        "translit"=> "sagi",
        "genitive"=> "Саги",
        "variants"=> [
            "саги"
        ]
    ],
    "Соня"=> [
        "translit"=> "sonya",
        "genitive"=> "Сони",
        "variants"=> [
            "соня"
        ]
    ],
    "Алинда"=> [
        "translit"=> "alinda",
        "genitive"=> "Алинды",
        "variants"=> [
            "алинда"
        ]
    ],
    "Гектор"=> [
        "translit"=> "gektor",
        "genitive"=> "Гектора",
        "variants"=> [
            "гектор"
        ]
    ],
    "Илиан"=> [
        "translit"=> "illian",
        "genitive"=> "Илиана",
        "variants"=> [
            "илиан"
        ]
    ],
    "Саид"=> [
        "translit"=> "said",
        "genitive"=> "Саида",
        "variants"=> [
            "саид"
        ]
    ],
    "Самир"=> [
        "translit"=> "samir",
        "genitive"=> "Самира",
        "variants"=> [
            "самир"
        ]
    ],
    "Сармат"=> [
        "translit"=> "sarmat",
        "genitive"=> "Сармата",
        "variants"=> [
            "сармат"
        ]
    ],
    "Юнис"=> [
        "translit"=> "yunis",
        "genitive"=> "Юниса",
        "variants"=> [
            "юнис"
        ]
    ],
    "Айрат"=> [
        "translit"=> "ajrat",
        "genitive"=> "Айрата",
        "variants"=> [
            "айрат"
        ]
    ],
    "Алдияр"=> [
        "translit"=> "aldiyar",
        "genitive"=> "Алдияр",
        "variants"=> [
            "алдияр"
        ]
    ],
    "Алихан"=> [
        "translit"=> "alihan",
        "genitive"=> "Алихана",
        "variants"=> [
            "алихан"
        ]
    ],
    "Алик"=> [
        "translit"=> "alik",
        "genitive"=> "Алика",
        "variants"=> [
            "алик"
        ]
    ],
    "Алим"=> [
        "translit"=> "alim",
        "genitive"=> "Алима",
        "variants"=> [
            "алим"
        ]
    ],
    "Алишер"=> [
        "translit"=> "alisher",
        "genitive"=> "Алишера",
        "variants"=> [
            "алишер"
        ]
    ],
    "Алмаз"=> [
        "translit"=> "almaz",
        "genitive"=> "Алмаза",
        "variants"=> [
            "алмаз"
        ]
    ],
    "Амирхан"=> [
        "translit"=> "amirhan",
        "genitive"=> "Амирхана",
        "variants"=> [
            "амирхан"
        ]
    ],
    "Арлан"=> [
        "translit"=> "arlan",
        "genitive"=> "Арлана",
        "variants"=> [
            "арлан"
        ]
    ],
    "Арман"=> [
        "translit"=> "arman",
        "genitive"=> "Армана",
        "variants"=> [
            "арман"
        ]
    ],
    "Арслан"=> [
        "translit"=> "arslan",
        "genitive"=> "Арслана",
        "variants"=> [
            "арслан"
        ]
    ],
    "Аскар"=> [
        "translit"=> "askar",
        "genitive"=> "Аскара",
        "variants"=> [
            "аскар"
        ]
    ],
    "Азиз"=> [
        "translit"=> "aziz",
        "genitive"=> "Азиза",
        "variants"=> [
            "азиз"
        ]
    ],
    "Эмин"=> [
        "translit"=> "emin",
        "genitive"=> "Эмина",
        "variants"=> [
            "эмин"
        ]
    ],
    "Ильдар"=> [
        "translit"=> "ildar",
        "genitive"=> "Ильдара",
        "variants"=> [
            "ильдар"
        ]
    ],
    "Ильнур"=> [
        "translit"=> "ilnur",
        "genitive"=> "Ильнур",
        "variants"=> [
            "ильнур"
        ]
    ],
    "Искандер"=> [
        "translit"=> "iskander",
        "genitive"=> "Искандера",
        "variants"=> [
            "искандер"
        ]
    ],
    "Исмаил"=> [
        "translit"=> "ismail",
        "genitive"=> "Исмаила",
        "variants"=> [
            "исмаил"
        ]
    ],
    "Мансур"=> [
        "translit"=> "mansur",
        "genitive"=> "Мансура",
        "variants"=> [
            "мансур"
        ]
    ],
    "Мирас"=> [
        "translit"=> "miras",
        "genitive"=> "Мираса",
        "variants"=> [
            "мирас"
        ]
    ],
    "Аружан"=> [
        "translit"=> "aruzhan",
        "genitive"=> "Аружана",
        "variants"=> [
            "аружан"
        ]
    ],
    "Рамиль"=> [
        "translit"=> "ramil",
        "genitive"=> "Рамиля",
        "variants"=> [
            "рамиль"
        ]
    ],
    "Самат"=> [
        "translit"=> "samat",
        "genitive"=> "Самата",
        "variants"=> [
            "самат"
        ]
    ],
    "Санжар"=> [
        "translit"=> "sanzhar",
        "genitive"=> "Санжар",
        "variants"=> [
            "санжар"
        ]
    ],
    "Шамиль"=> [
        "translit"=> "shamil",
        "genitive"=> "Шамиля",
        "variants"=> [
            "шамиль"
        ]
    ],
    "Сулейман"=> [
        "translit"=> "sulejman",
        "genitive"=> "Сулеймана",
        "variants"=> [
            "сулейман"
        ]
    ],
    "Тагир"=> [
        "translit"=> "tagir",
        "genitive"=> "Тагира",
        "variants"=> [
            "тагир"
        ]
    ],
    "Таир"=> [
        "translit"=> "tair",
        "genitive"=> "Таира",
        "variants"=> [
            "таир"
        ]
    ],
    "Тамерлана"=> [
        "translit"=> "tamerlan",
        "genitive"=> "Тамерлана",
        "variants"=> [
            "тамерлана"
        ]
    ],
    "Велизар"=> [
        "translit"=> "velizar",
        "genitive"=> "Велизара",
        "variants"=> [
            "велизар"
        ]
    ],
    "Всеволод"=> [
        "translit"=> "vsevolod",
        "genitive"=> "Всеволода",
        "variants"=> [
            "всеволод"
        ]
    ],
    "Аиша"=> [
        "translit"=> "aisha",
        "genitive"=> "Аиши",
        "variants"=> [
            "аиша"
        ]
    ],
    "Айзере"=> [
        "translit"=> "ajzere",
        "genitive"=> "Айзере",
        "variants"=> [
            "айзере"
        ]
    ],
    "Анель"=> [
        "translit"=> "anel",
        "genitive"=> "Анель",
        "variants"=> [
            "анель"
        ]
    ],
    "Ария"=> [
        "translit"=> "ariya",
        "genitive"=> "Арии",
        "variants"=> [
            "ария"
        ]
    ],
    "Диля"=> [
        "translit"=> "dilya",
        "genitive"=> "Дили",
        "variants"=> [
            "диля"
        ]
    ],
    "Диляра"=> [
        "translit"=> "dilyara",
        "genitive"=> "Диляры",
        "variants"=> [
            "диляра"
        ]
    ],
    "Элля"=> [
        "translit"=> "ellya",
        "genitive"=> "Элли",
        "variants"=> [
            "элля"
        ]
    ],
    "Ивона"=> [
        "translit"=> "iona",
        "genitive"=> "Ивоны",
        "variants"=> [
            "ивона"
        ]
    ],
    "Джамилия"=> [
        "translit"=> "dzhamiliya",
        "genitive"=> "Джамилии",
        "variants"=> [
            "джамилия"
        ]
    ],
    "Лилиана"=> [
        "translit"=> "liliana",
        "genitive"=> "Лилианы",
        "variants"=> [
            "лилиана"
        ]
    ],
    "Лия"=> [
        "translit"=> "liya",
        "genitive"=> "Лии",
        "variants"=> [
            "лия"
        ]
    ],
    "Луиза"=> [
        "translit"=> "luisa",
        "genitive"=> "Луизы",
        "variants"=> [
            "луиза"
        ]
    ],
    "Медина"=> [
        "translit"=> "medina",
        "genitive"=> "Медины",
        "variants"=> [
            "медина"
        ]
    ],
    "Моника"=> [
        "translit"=> "monika",
        "genitive"=> "Моники",
        "variants"=> [
            "моника"
        ]
    ],
    "Радмила"=> [
        "translit"=> "radmila",
        "genitive"=> "Радмилы",
        "variants"=> [
            "радмила"
        ]
    ],
    "Ралина"=> [
        "translit"=> "ralina",
        "genitive"=> "Ралины",
        "variants"=> [
            "ралина"
        ]
    ],
    "Раяна"=> [
        "translit"=> "rayana",
        "genitive"=> "Раяны",
        "variants"=> [
            "раяна"
        ]
    ],
    "Разима"=> [
        "translit"=> "razima",
        "genitive"=> "Разимы",
        "variants"=> [
            "разима"
        ]
    ],
    "Руфина"=> [
        "translit"=> "rufina",
        "genitive"=> "Руфины",
        "variants"=> [
            "руфина"
        ]
    ],
    "Сафина"=> [
        "translit"=> "safina",
        "genitive"=> "Сафины",
        "variants"=> [
            "сафина"
        ]
    ],
    "Саида"=> [
        "translit"=> "saida",
        "genitive"=> "Саиды",
        "variants"=> [
            "саида"
        ]
    ],
    "Виталина"=> [
        "translit"=> "vitalina",
        "genitive"=> "Виталины",
        "variants"=> [
            "виталина"
        ]
    ],
    "Анжелина"=> [
        "translit"=> "anzhelina",
        "genitive"=> "Анжелины",
        "variants"=> [
            "анжелина"
        ]
    ],
    "Элен"=> [
        "translit"=> "elen",
        "genitive"=> "Элен",
        "variants"=> [
            "элен"
        ]
    ],
    "Камиля"=> [
        "translit"=> "kamilya",
        "genitive"=> "Камилы",
        "variants"=> [
            "камиля"
        ]
    ],
    "Лана"=> [
        "translit"=> "lana",
        "genitive"=> "Ланы",
        "variants"=> [
            "лана"
        ]
    ],
    "Наргиза"=> [
        "translit"=> "nargiza",
        "genitive"=> "Наргизы",
        "variants"=> [
            "наргиза",
            "наргиз"
        ]
    ],
    "Рита"=> [
        "translit"=> "rita",
        "genitive"=> "Риты",
        "variants"=> [
            "рита"
        ]
    ],
    "Самина"=> [
        "translit"=> "samina",
        "genitive"=> "Самины",
        "variants"=> [
            "самина"
        ]
    ],
    "Станислава"=> [
        "translit"=> "stanislava",
        "genitive"=> "Станиславы",
        "variants"=> [
            "станислава"
        ]
    ],
    "Зухра"=> [
        "translit"=> "zuhra",
        "genitive"=> "Зухры",
        "variants"=> [
            "зухра"
        ]
    ],
    "Элли"=> [
        "translit"=> "elli",
        "genitive"=> "Элли",
        "variants"=> [
            "элли"
        ]
    ],
    "Асель"=> [
        "translit"=> "asel",
        "genitive"=> "Асель",
        "variants"=> [
            "асель"
        ]
    ],
    "Данияр"=> [
        "translit"=> "daniyar",
        "genitive"=> "Данияр",
        "variants"=> [
            "данияр"
        ]
    ],
    "Дильназ"=> [
        "translit"=> "dilnaz",
        "genitive"=> "Дильназ",
        "variants"=> [
            "дильназ"
        ]
    ],
    "Жанель"=> [
        "translit"=> "zhanel",
        "genitive"=> "Жанель",
        "variants"=> [
            "жанель"
        ]
    ],
    "Чулпан"=> [
        "translit"=> "chulpan",
        "genitive"=> "Чулпан",
        "variants"=> [
            "чулпан"
        ]
    ],
    "Альтея"=> [
        "translit"=> "alteya",
        "genitive"=> "Альтеи",
        "variants"=> [
            "альтея"
        ]
    ],
    "Амалия"=> [
        "translit"=> "amaliya",
        "genitive"=> "Амалии",
        "variants"=> [
            "амалия"
        ]
    ],
    "Ариэла"=> [
        "translit"=> "ariela",
        "genitive"=> "Ариэлы",
        "variants"=> [
            "ариэла"
        ]
    ],
    "Бекки"=> [
        "translit"=> "bekki",
        "genitive"=> "Бекки",
        "variants"=> [
            "бекки",
            "беки"
        ]
    ],
    "Дарьяна"=> [
        "translit"=> "darjyana",
        "genitive"=> "Дарьяны",
        "variants"=> [
            "дарьяна"
        ]
    ],
    "Габи"=> [
        "translit"=> "gabi",
        "genitive"=> "Габи",
        "variants"=> [
            "габи"
        ]
    ],
    "Лалена"=> [
        "translit"=> "lalena",
        "genitive"=> "Лалены",
        "variants"=> [
            "лалена"
        ]
    ],
    "Мелания"=> [
        "translit"=> "melaniya",
        "genitive"=> "Мелании",
        "variants"=> [
            "мелания"
        ]
    ],
    "Согдиана"=> [
        "translit"=> "sogdiana",
        "genitive"=> "Согдианы",
        "variants"=> [
            "согдиана"
        ]
    ],
    "Стефани"=> [
        "translit"=> "stefani",
        "genitive"=> "Стефани",
        "variants"=> [
            "стефани"
        ]
    ],
    "Светара"=> [
        "translit"=> "svetara",
        "genitive"=> "Светары",
        "variants"=> [
            "светара"
        ]
    ],
    "Гамзат"=> [
        "translit"=> "gamzat",
        "genitive"=> "Гамзата",
        "variants"=> [
            "гамзат"
        ]
    ],
    "Кристофер"=> [
        "translit"=> "kristofer",
        "genitive"=> "Кристофера",
        "variants"=> [
            "кристофер"
        ]
    ],
    "Мухаммед Али"=> [
        "translit"=> "muhhamedali",
        "genitive"=> "МухаммедаАли",
        "variants"=> [
            "мухаммед али"
        ]
    ],
    "Ричард"=> [
        "translit"=> "richard",
        "genitive"=> "Ричарда",
        "variants"=> [
            "ричард"
        ]
    ],
    "Дориан"=> [
        "translit"=> "dorian",
        "genitive"=> "Дориана",
        "variants"=> [
            "дориан"
        ]
    ],
    "Даниэл"=> [
        "translit"=> "danieel",
        "genitive"=> "Даниэла",
        "variants"=> [
            "даниэл"
        ]
    ],
    "Айсель"=> [
        "translit"=> "ajsel",
        "genitive"=> "Айсель",
        "variants"=> [
            "айсель"
        ]
    ],
    "Хадижа"=> [
        "translit"=> "hadizha",
        "genitive"=> "Хадижи",
        "variants"=> [
            "хадижа"
        ]
    ],
    "Жания"=> [
        "translit"=> "zhaniya",
        "genitive"=> "Жании",
        "variants"=> [
            "жания"
        ]
    ],
    "Нарт"=> [
        "translit"=> "nart",
        "genitive"=> "Нарта",
        "variants"=> [
            "нарт"
        ]
    ]
];

$video = [
	"zhaniya"=> "-16599924044987549",
    "hadizha"=> "-16599924044987551",
    "ajsel"=> "-16599924044987552",
    "nart"=> "-16599924044987553",
    "dorian"=> "-16599924044987554",
    "danieel"=> "-16599924044987555",
    "zhanel"=> "-16599924044987556",
    "svetara"=> "-16599924044987557",
    "stefani"=> "-16599924044987558",
    "sogdiana"=> "-16599924044987559",
    "melaniya"=> "-16599924044987560",
    "marjyam"=> "-16599924044987561",
    "lalena"=> "-16599924044987562",
    "gera"=> "-16599924044988124",
    "gabi"=> "-16599924044987564",
    "dilnaz"=> "-16599924044987565",
    "darjyana"=> "-16599924044987566",
    "daniyar"=> "-16599924044987567",
    "chulpan"=> "-16599924044987568",
    "bekki"=> "-16599924044987569",
    "asel"=> "-16599924044987570",
    "ariela"=> "-16599924044987571",
    "amaliya"=> "-16599924044987572",
    "alteya"=> "-16599924044987573",
    "richard"=> "-16599924044987574",
    "muhhamedali"=> "-16599924044987575",
    "kristofer"=> "-16599924044987576",
    "gamzat"=> "-16599924044987577",
    "vitalina"=> "-16599924044987578",
    "tamerlan"=> "-16599924044987579",
    "tair"=> "-16599924044987580",
    "stanislava"=> "-16599924044987581",
    "nargiza"=> "-16599924044987582",
    "miras"=> "-16599924044987583",
    "iskander"=> "-16599924044987584",
    "iona"=> "-16599924044987585",
    "elen"=> "-16599924044987586",
    "dzhamiliya"=> "-16599924044987587",
    "dilyara"=> "-16599924044987588",
    "anel"=> "-16599924044987589",
    "amirhan"=> "-16599924044987590",
    "almaz"=> "-16599924044987591",
    "alim"=> "-16599924044987592",
    "zuhra"=> "-16599924044987593",
    "safina"=> "-16599924044987596",
    "rita"=> "-16599924044987597",
    "razima"=> "-16599924044987598",
    "ramil"=> "-16599924044987601",
    "liliana"=> "-16599924044987604",
    "kamilya"=> "-16599924044987605",
    "ellya"=> "-16599924044987608",
    "aruzhan"=> "-16599924044987612",
    "arslan"=> "-16599924044987613",
    "alihan"=> "-16599924044987618",
    "aldiyar"=> "-16599924044987619",
    "ajzere"=> "-16599924044987620",
    "aisha"=> "-16599924044987621",
    "samina"=> "-16599924044987625",
    "saida"=> "-16599924044987626",
    "rufina"=> "-16599924044987628",
    "rayana"=> "-16599924044987631",
    "ralina"=> "-16599924044987632",
    "radmila"=> "-16599924044987633",
    "monika"=> "-16599924044987635",
    "medina"=> "-16599924044987636",
    "luisa"=> "-16599924044987637",
    "liya"=> "-16599924044987638",
    "lana"=> "-16599924044987640",
    "dilya"=> "-16599924044987647",
    "ariya"=> "-16599924044987648",
    "anzhelina"=> "-16599924044987649",
    "vsevolod"=> "-16599924044987653",
    "velizar"=> "-16599924044987654",
    "tagir"=> "-16599924044987657",
    "sulejman"=> "-16599924044987658",
    "shamil"=> "-16599924044987659",
    "sanzhar"=> "-16599924044987660",
    "samat"=> "-16599924044987661",
    "mansur"=> "-16599924044987664",
    "ismail"=> "-16599924044987665",
    "ilnur"=> "-16599924044987667",
    "ildar"=> "-16599924044987668",
    "emin"=> "-16599924044987669",
    "aziz"=> "-16599924044987670",
    "askar"=> "-16599924044987671",
    "arman"=> "-16599924044987674",
    "arlan"=> "-16599924044987675",
    "alisher"=> "-16599924044987678",
    "alik"=> "-16599924044987680",
    "ajrat"=> "-16599924044987683",
    "sonya"=> "-16599924044987714",
    "sagi"=> "-16599924044987715",
    "sagdiana"=> "-16599924044987716",
    "petra"=> "-16599924044987717",
    "mishel-w"=> "-16599924044987718",
    "liam"=> "-16599924044987719",
    "ivana"=> "-16599924044987720",
    "gaya"=> "-16599924044987722",
    "flora"=> "-16599924044987723",
    "elli"=> "-16599924044987725",
    "alinda"=> "-16599924044987726",
    "yunis"=> "-16599924044987727",
    "sarmat"=> "-16599924044987728",
    "samir"=> "-16599924044987729",
    "said"=> "-16599924044987730",
    "illian"=> "-16599924044987732",
    "gektor"=> "-16599924044987733",
    "zlata"=> "-16599924044987734",
    "dzhesika"=> "-16599924044987742",
    "daya"=> "-16599924044987743",
    "zahar"=> "-16599924044987744",
    "yasmina"=> "-16599924044987745",
    "yasmin"=> "-16599924044987746",
    "taya"=> "-16599924044987747",
    "sabrina"=> "-16599924044987748",
    "patrisiya"=> "-16599924044987749",
    "nia"=> "-16599924044987750",
    "nehama"=> "-16599924044987751",
    "mirra"=> "-16599924044987752",
    "midina"=> "-16599924044987753",
    "malilka"=> "-16599924044987754",
    "madina"=> "-16599924044987755",
    "lukeriya"=> "-16599924044987756",
    "linda"=> "-16599924044987757",
    "lara"=> "-16599924044987758",
    "kimberli"=> "-16599924044987759",
    "iva"=> "-16599924044987760",
    "ionna"=> "-16599924044987761",
    "ilona"=> "-16599924044987762",
    "hana"=> "-16599924044987763",
    "hamza"=> "-16599924044987764",
    "franczeska"=> "-16599924044987766",
    "fatima"=> "-16599924044987767",
    "elina"=> "-16599924044987768",
    "dzhenifer"=> "-16599924044987770",
    "zaki"=> "-16599924044987771",
    "yanis"=> "-16599924044987772",
    "vlad"=> "-16599924044987773",
    "tamuka"=> "-16599924044987774",
    "solmaz"=> "-16599924044987775",
    "salvador"=> "-16599924044987777",
    "dana"=> "-16599924044987778",
    "salavat"=> "-16599924044987779",
    "bella"=> "-16599924044987780",
    "rasul"=> "-16599924044987781",
    "aziza"=> "-16599924044987782",
    "rajen"=> "-16599924044987783",
    "ayana"=> "-16599924044987784",
    "rafael"=> "-16599924044987785",
    "arianna"=> "-16599924044987786",
    "narek"=> "-16599924044987787",
    "moisej"=> "-16599924044987788",
    "anisiya"=> "-16599924044987789",
    "mitya"=> "-16599924044987790",
    "almira"=> "-16599924044987791",
    "mishel"=> "-16599924044987792",
    "aliya"=> "-16599924044987793",
    "miram"=> "-16599924044987794",
    "alexandrina"=> "-16599924044987795",
    "mikael"=> "-16599924044987796",
    "alana"=> "-16599924044987797",
    "migel"=> "-16599924044987798",
    "malik"=> "-16599924044987799",
    "lukas"=> "-16599924044987800",
    "leonel"=> "-16599924044987801",
    "leo"=> "-16599924044987802",
    "len"=> "-16599924044987803",
    "kris"=> "-16599924044987804",
    "klim"=> "-16599924044987805",
    "islam"=> "-16599924044987806",
    "iraklij"=> "-16599924044987807",
    "ibragim"=> "-16599924044987808",
    "hajni"=> "-16599924044987809",
    "edem"=> "-16599924044987810",
    "dariush"=> "-16599924044987811",
    "badri"=> "-16599924044987812",
    "azat"=> "-16599924044987813",
    "ashhen"=> "-16599924044987814",
    "aron"=> "-16599924044987815",
    "aren"=> "-16599924044987816",
    "anis"=> "-16599924044987817",
    "amir"=> "-16599924044987818",
    "amin"=> "-16599924044987819",
    "ali"=> "-16599924044987820",
    "alan"=> "-16599924044987821",
    "ajdar"=> "-16599924044987822",
    "abulhair"=> "-16599924044987823",
    "eseniya"=> "-16599924044987824",
    "ameliya"=> "-16599924044987825",
    "sati"=> "-16599924044987826",
    "olesya"=> "-16599924044987829",
    "lejla"=> "-16599924044987830",
    "laura"=> "-16599924044987831",
    "dasha"=> "-16599924044987835",
    "aureliya"=> "-16599924044987839",
    "rapsime"=> "-16599924044987841",
    "zulejha"=> "-16599924044987842",
    "zhasmin"=> "-16599924044987843",
    "viviana"=> "-16599924044987844",
    "varya"=> "-16599924044987845",
    "suzanna"=> "-16599924044987846",
    "nonna"=> "-16599924044987849",
    "nazilya"=> "-16599924044987850",
    "nadilya"=> "-16599924044987851",
    "maryana"=> "-16599924044987852",
    "marusya"=> "-16599924044987853",
    "mariam"=> "-16599924044987854",
    "lisa"=> "-16599924044987855",
    "lilit"=> "-16599924044987857",
    "izabella"=> "-16599924044987860",
    "iskra"=> "-16599924044987861",
    "irada"=> "-16599924044987862",
    "feoniya"=> "-16599924044987863",
    "elvina"=> "-16599924044987864",
    "elizabett"=> "-16599924044987865",
    "eliza"=> "-16599924044987866",
    "elisaveta"=> "-16599924044987867",
    "dzhuliya"=> "-16599924044987869",
    "dinara"=> "-16599924044987870",
    "dayana"=> "-16599924044987871",
    "zhora"=> "-16599924044987874",
    "arzy"=> "-16599924044987876",
    "vazgen"=> "-16599924044987877",
    "arseniya"=> "-16599924044987878",
    "tolya"=> "-16599924044987879",
    "arina"=> "-16599924044987880",
    "talib"=> "-16599924044987881",
    "tahir"=> "-16599924044987882",
    "ariadna"=> "-16599924044987883",
    "seva"=> "-16599924044987884",
    "ani"=> "-16599924044987885",
    "ovanes"=> "-16599924044987886",
    "alyona"=> "-16599924044987887",
    "olaf"=> "-16599924044987888",
    "alie"=> "-16599924044987889",
    "nils"=> "-16599924044987890",
    "nail"=> "-16599924044987892",
    "munir"=> "-16599924044987893",
    "adriana"=> "-16599924044987894",
    "majkl"=> "-16599924044987895",
    "levon"=> "-16599924044987896",
    "karen"=> "-16599924044987897",
    "kamil"=> "-16599924044987898",
    "iliya"=> "-16599924044987899",
    "iakov"=> "-16599924044987900",
    "gevorg"=> "-16599924044987901",
    "gavriil"=> "-16599924044987902",
    "elmir"=> "-16599924044987903",
    "bulat"=> "-16599924044987904",
    "anush"=> "-16599924044987905",
    "andranik"=> "-16599924044987906",
    "alfred"=> "-16599924044987908",
    "aleks"=> "-16599924044987909",
    "akop"=> "-16599924044987910",
    "ainur"=> "-16599924044987911",
    "adjyan"=> "-16599924044987912",
    "yaromir"=> "-16599924044987913",
    "vaczlav"=> "-16599924044987914",
    "stefan"=> "-16599924044987917",
    "savva"=> "-16599924044987918",
    "samson"=> "-16599924044987919",
    "rufat"=> "-16599924044987920",
    "radion"=> "-16599924044987921",
    "plamen"=> "-16599924044987922",
    "olof"=> "-16599924044987923",
    "maryam"=> "-16599924044987925",
    "marat"=> "-16599924044987926",
    "magamed"=> "-16599924044987927",
    "lyaman"=> "-16599924044987928",
    "luis"=> "-16599924044987929",
    "emir"=> "-16599924044987930",
    "elbrus"=> "-16599924044987931",
    "dobromir"=> "-16599924044987932",
    "darian"=> "-16599924044987933",
    "bill"=> "-16599924044987934",
    "azamat"=> "-16599924044987935",
    "artemij"=> "-16599924044987936",
    "arifmetikon"=> "-16599924044987937",
    "rodion"=> "-16599924044987965",
    "murad"=> "-16599924044987966",
    "miloslava"=> "-16599924044987967",
    "luka"=> "-16599924044987968",
    "dobrynya"=> "-16599924044987971",
    "diana"=> "-16599924044987972",
    "denis"=> "-16599924044987973",
    "vilyam"=> "-16599924044987974",
    "borislava"=> "-16599924044987975",
    "appolinarij"=> "-16599924044987976",
    "man"=> "-16599924044987977",
    "abram"=> "-16599924044987978",
    "ada"=> "-16599924044987979",
    "adam"=> "-16599924044987980",
    "adel"=> "-16599924044987981",
    "adelina"=> "-16599924044987982",
    "adeliya"=> "-16599924044987983",
    "afanasij"=> "-16599924044987984",
    "afanasiya"=> "-16599924044987985",
    "agafiya"=> "-16599924044987986",
    "agafya"=> "-16599924044987987",
    "agata"=> "-16599924044987988",
    "aglaya"=> "-16599924044987989",
    "agnesa"=> "-16599924044987990",
    "agnessa"=> "-16599924044987991",
    "agniya"=> "-16599924044987992",
    "ahmad"=> "-16599924044987993",
    "aida"=> "-16599924044987994",
    "ajgul"=> "-16599924044987995",
    "ajlin"=> "-16599924044987996",
    "akbar"=> "-16599924044987997",
    "akim"=> "-16599924044987998",
    "aksinya"=> "-16599924044987999",
    "albert"=> "-16599924044988000",
    "albina"=> "-16599924044988001",
    "aleksandra"=> "-16599924044988002",
    "alevtina"=> "-16599924044988003",
    "alfiya"=> "-16599924044988004",
    "alika"=> "-16599924044988006",
    "alina"=> "-16599924044988007",
    "alisa"=> "-16599924044988008",
    "alisiya"=> "-16599924044988009",
    "alla"=> "-16599924044988010",
    "alsu"=> "-16599924044988011",
    "amiliya"=> "-16599924044988014",
    "amira"=> "-16599924044988015",
    "andrej"=> "-16599924044988016",
    "andriana"=> "-16599924044988017",
    "anfisa"=> "-16599924044988018",
    "angelina"=> "-16599924044988019",
    "anisim"=> "-16599924044988020",
    "anita"=> "-16599924044988022",
    "anna-mariya"=> "-16599924044988023",
    "anton"=> "-16599924044988024",
    "antonina"=> "-16599924044988025",
    "anya"=> "-16599924044988026",
    "anzhela"=> "-16599924044988027",
    "anzhelika"=> "-16599924044988028",
    "apollinariya"=> "-16599924044988029",
    "arhip"=> "-16599924044988030",
    "ariana"=> "-16599924044988031",
    "arkadij"=> "-16599924044988033",
    "armen"=> "-16599924044988034",
    "arnold"=> "-16599924044988035",
    "arsen"=> "-16599924044988036",
    "arsenij"=> "-16599924044988037",
    "artur"=> "-16599924044988038",
    "artyom"=> "-16599924044988039",
    "ashot"=> "-16599924044988040",
    "askold"=> "-16599924044988041",
    "aslan"=> "-16599924044988042",
    "asya"=> "-16599924044988043",
    "avdotya"=> "-16599924044988044",
    "avgust"=> "-16599924044988045",
    "avraam"=> "-16599924044988046",
    "avreliya"=> "-16599924044988047",
    "avrora"=> "-16599924044988048",
    "azaliya"=> "-16599924044988049",
    "batyr"=> "-16599924044988050",
    "bazhena"=> "-16599924044988051",
    "beata"=> "-16599924044988052",
    "beatrisa"=> "-16599924044988053",
    "bela"=> "-16599924044988054",
    "bogdan"=> "-16599924044988055",
    "bogdana"=> "-16599924044988056",
    "borislav"=> "-16599924044988057",
    "borya"=> "-16599924044988058",
    "czezar"=> "-16599924044988059",
    "damir"=> "-16599924044988060",
    "daniel"=> "-16599924044988062",
    "daniela"=> "-16599924044988063",
    "daniil"=> "-16599924044988064",
    "danila"=> "-16599924044988065",
    "danis"=> "-16599924044988066",
    "dara"=> "-16599924044988067",
    "darina"=> "-16599924044988068",
    "david"=> "-16599924044988070",
    "demid"=> "-16599924044988071",
    "demyan"=> "-16599924044988072",
    "deniel"=> "-16599924044988073",
    "devid"=> "-16599924044988074",
    "dima"=> "-16599924044988075",
    "dina"=> "-16599924044988076",
    "dominika"=> "-16599924044988077",
    "dorofej"=> "-16599924044988078",
    "dzhamal"=> "-16599924044988079",
    "dzhamil"=> "-16599924044988080",
    "edgar"=> "-16599924044988081",
    "eduard"=> "-16599924044988082",
    "efim"=> "-16599924044988083",
    "efimiya"=> "-16599924044988084",
    "efrosiniya"=> "-16599924044988085",
    "egor"=> "-16599924044988086",
    "eldar"=> "-16599924044988087",
    "eleonora"=> "-16599924044988088",
    "eliaz"=> "-16599924044988089",
    "elisej"=> "-16599924044988090",
    "elmira"=> "-16599924044988091",
    "elvira"=> "-16599924044988092",
    "elza"=> "-16599924044988093",
    "emelyan"=> "-16599924044988094",
    "emil"=> "-16599924044988095",
    "emili"=> "-16599924044988096",
    "emma"=> "-16599924044988097",
    "emmanuil"=> "-16599924044988098",
    "eremej"=> "-16599924044988099",
    "erenest"=> "-16599924044988100",
    "erik"=> "-16599924044988101",
    "ernest"=> "-16599924044988102",
    "erofej"=> "-16599924044988103",
    "estel"=> "-16599924044988105",
    "eva"=> "-16599924044988106",
    "evangelina"=> "-16599924044988107",
    "evdokiya"=> "-16599924044988108",
    "evelina"=> "-16599924044988109",
    "evpraksiya"=> "-16599924044988110",
    "evridika"=> "-16599924044988111",
    "ezgi"=> "-16599924044988112",
    "faina"=> "-16599924044988113",
    "farhat"=> "-16599924044988114",
    "fedora"=> "-16599924044988115",
    "fedya"=> "-16599924044988116",
    "feliks"=> "-16599924044988117",
    "filipp"=> "-16599924044988118",
    "foma"=> "-16599924044988119",
    "galina"=> "-16599924044988120",
    "gamlet"=> "-16599924044988121",
    "gena"=> "-16599924044988122",
    "georgij"=> "-16599924044988123",
    "gerasim"=> "-16599924044988125",
    "german"=> "-16599924044988126",
    "girl"=> "-16599924044988127",
    "glafira"=> "-16599924044988128",
    "gleb"=> "-16599924044988129",
    "gloriya"=> "-16599924044988130",
    "gochi"=> "-16599924044988131",
    "gogi"=> "-16599924044988132",
    "gordej"=> "-16599924044988133",
    "gorislav"=> "-16599924044988134",
    "grisha"=> "-16599924044988135",
    "gulnaz"=> "-16599924044988136",
    "hakim"=> "-16599924044988137",
    "hariton"=> "-16599924044988138",
    "ida"=> "-16599924044988139",
    "ignatij"=> "-16599924044988140",
    "igor"=> "-16599924044988141",
    "iisus"=> "-16599924044988142",
    "ilariya"=> "-16599924044988143",
    "ilya"=> "-16599924044988145",
    "ilyas"=> "-16599924044988146",
    "inessa"=> "-16599924044988147",
    "inga"=> "-16599924044988148",
    "inna"=> "-16599924044988149",
    "innokentij"=> "-16599924044988150",
    "iosif"=> "-16599924044988151",
    "ira"=> "-16599924044988152",
    "iraida"=> "-16599924044988153",
    "ivanna"=> "-16599924044988154",
    "iya"=> "-16599924044988155",
    "izrail"=> "-16599924044988156",
    "izyaslav"=> "-16599924044988157",
    "kamal"=> "-16599924044988158",
    "kamilla"=> "-16599924044988160",
    "karim"=> "-16599924044988162",
    "karina"=> "-16599924044988163",
    "karolina"=> "-16599924044988164",
    "katya"=> "-16599924044988165",
    "kaya"=> "-16599924044988166",
    "kazimir"=> "-16599924044988167",
    "kir"=> "-16599924044988168",
    "kira"=> "-16599924044988169",
    "kirill"=> "-16599924044988170",
    "klara"=> "-16599924044988171",
    "klava"=> "-16599924044988172",
    "kolya"=> "-16599924044988173",
    "kormak"=> "-16599924044988174",
    "kostya"=> "-16599924044988175",
    "kristian"=> "-16599924044988176",
    "kristina"=> "-16599924044988177",
    "ksyusha"=> "-16599924044988178",
    "kuzma"=> "-16599924044988179",
    "lada"=> "-16599924044988180",
    "lavr"=> "-16599924044988181",
    "lejsan"=> "-16599924044988182",
    "lena"=> "-16599924044988183",
    "leon"=> "-16599924044988184",
    "leonid"=> "-16599924044988185",
    "leopold"=> "-16599924044988186",
    "lera"=> "-16599924044988187",
    "lesha"=> "-16599924044988188",
    "lesya"=> "-16599924044988189",
    "leya"=> "-16599924044988190",
    "liana"=> "-16599924044988191",
    "lida"=> "-16599924044988192",
    "lili"=> "-16599924044988193",
    "liliya"=> "-16599924044988194",
    "lina"=> "-16599924044988195",
    "liza"=> "-16599924044988196",
    "lukyan"=> "-16599924044988197",
    "lyuba"=> "-16599924044988198",
    "lyuda"=> "-16599924044988199",
    "madlen"=> "-16599924044988200",
    "magdalina"=> "-16599924044988201",
    "mahmud"=> "-16599924044988202",
    "majya"=> "-16599924044988203",
    "makar"=> "-16599924044988204",
    "maksim"=> "-16599924044988205",
    "maksimilyan"=> "-16599924044988206",
    "marfa"=> "-16599924044988208",
    "margarita"=> "-16599924044988209",
    "marianna"=> "-16599924044988210",
    "marina"=> "-16599924044988211",
    "mark"=> "-16599924044988212",
    "marsel"=> "-16599924044988213",
    "marta"=> "-16599924044988214",
    "martin"=> "-16599924044988215",
    "masha"=> "-16599924044988217",
    "matilda"=> "-16599924044988218",
    "matvej"=> "-16599924044988219",
    "maya"=> "-16599924044988220",
    "melissa"=> "-16599924044988221",
    "mihael"=> "-16599924044988222",
    "mihej"=> "-16599924044988223",
    "mila"=> "-16599924044988224",
    "milan"=> "-16599924044988225",
    "milana"=> "-16599924044988226",
    "milena"=> "-16599924044988227",
    "mira"=> "-16599924044988228",
    "miron"=> "-16599924044988229",
    "miroslav"=> "-16599924044988230",
    "miroslava"=> "-16599924044988231",
    "misha"=> "-16599924044988232",
    "mitrofan"=> "-16599924044988233",
    "miya"=> "-16599924044988234",
    "mstislav"=> "-16599924044988235",
    "mstislava"=> "-16599924044988236",
    "muhtar"=> "-16599924044988237",
    "murat"=> "-16599924044988238",
    "muslim"=> "-16599924044988239",
    "mustafa"=> "-16599924044988240",
    "nadya"=> "-16599924044988241",
    "nastya"=> "-16599924044988242",
    "natan"=> "-16599924044988243",
    "nataniel"=> "-16599924044988244",
    "natasha"=> "-16599924044988245",
    "naum"=> "-16599924044988246",
    "nazar"=> "-16599924044988247",
    "nelli"=> "-16599924044988248",
    "nestor"=> "-16599924044988249",
    "nigyar"=> "-16599924044988250",
    "nika"=> "-16599924044988251",
    "nikita"=> "-16599924044988252",
    "nikol"=> "-16599924044988253",
    "nil"=> "-16599924044988254",
    "nina"=> "-16599924044988255",
    "ninel"=> "-16599924044988256",
    "nora"=> "-16599924044988257",
    "oksana"=> "-16599924044988258",
    "oleg"=> "-16599924044988259",
    "oliviya"=> "-16599924044988261",
    "olya"=> "-16599924044988262",
    "omar"=> "-16599924044988263",
    "osip"=> "-16599924044988264",
    "oskar"=> "-16599924044988265",
    "osman"=> "-16599924044988266",
    "pahom"=> "-16599924044988267",
    "parfyon"=> "-16599924044988268",
    "pasha"=> "-16599924044988269",
    "pavla"=> "-16599924044988270",
    "pelageya"=> "-16599924044988271",
    "petya"=> "-16599924044988272",
    "platon"=> "-16599924044988273",
    "polina"=> "-16599924044988274",
    "praskovya"=> "-16599924044988275",
    "prohor"=> "-16599924044988276",
    "rada"=> "-16599924044988277",
    "radel"=> "-16599924044988278",
    "radimir"=> "-16599924044988279",
    "radmir"=> "-16599924044988280",
    "radmira"=> "-16599924044988281",
    "ramazan"=> "-16599924044988282",
    "rashid"=> "-16599924044988283",
    "ratmir"=> "-16599924044988284",
    "raya"=> "-16599924044988285",
    "regina"=> "-16599924044988286",
    "renat"=> "-16599924044988287",
    "renata"=> "-16599924044988288",
    "riana"=> "-16599924044988290",
    "rimma"=> "-16599924044988291",
    "robert"=> "-16599924044988292",
    "rolan"=> "-16599924044988293",
    "roma"=> "-16599924044988294",
    "rostislav"=> "-16599924044988295",
    "rostislava"=> "-16599924044988296",
    "roza"=> "-16599924044988297",
    "ruben"=> "-16599924044988298",
    "ruslan"=> "-16599924044988299",
    "ruslana"=> "-16599924044988300",
    "rustam"=> "-16599924044988301",
    "sabina"=> "-16599924044988302",
    "samira"=> "-16599924044988303",
    "sandro"=> "-16599924044988304",
    "aleksandr"=> "-16599924044988305",
    "savelij"=> "-16599924044988306",
    "semyon"=> "-16599924044988308",
    "serafim"=> "-16599924044988309",
    "serafima"=> "-16599924044988310",
    "sergej"=> "-16599924044988311",
    "sevastyan"=> "-16599924044988312",
    "sevil"=> "-16599924044988313",
    "slava"=> "-16599924044988314",
    "snezhana"=> "-16599924044988315",
    "sofiya"=> "-16599924044988316",
    "sofya"=> "-16599924044988317",
    "solomon"=> "-16599924044988318",
    "stas"=> "-16599924044988319",
    "stefaniya"=> "-16599924044988320",
    "stella"=> "-16599924044988321",
    "styopa"=> "-16599924044988322",
    "sultan"=> "-16599924044988323",
    "susanna"=> "-16599924044988324",
    "sveta"=> "-16599924044988325",
    "svyatoslav"=> "-16599924044988326",
    "taisiya"=> "-16599924044988327",
    "tamila"=> "-16599924044988328",
    "tanya"=> "-16599924044988329",
    "taras"=> "-16599924044988330",
    "tejmur"=> "-16599924044988331",
    "teona"=> "-16599924044988332",
    "tigran"=> "-16599924044988333",
    "tihon"=> "-16599924044988334",
    "timofej"=> "-16599924044988335",
    "timur"=> "-16599924044988336",
    "toma"=> "-16599924044988337",
    "trofim"=> "-16599924044988338",
    "ulyana"=> "-16599924044988339",
    "uma"=> "-16599924044988340",
    "umar"=> "-16599924044988341",
    "vadim"=> "-16599924044988343",
    "valentin"=> "-16599924044988344",
    "valentina"=> "-16599924044988345",
    "valerij"=> "-16599924044988346",
    "vanya"=> "-16599924044988347",
    "varvara"=> "-16599924044988348",
    "vasilina"=> "-16599924044988349",
    "vasilisa"=> "-16599924044988350",
    "vasya"=> "-16599924044988351",
    "veniamin"=> "-16599924044988352",
    "vera"=> "-16599924044988353",
    "veronika"=> "-16599924044988354",
    "vesta"=> "-16599924044988355",
    "vika"=> "-16599924044988356",
    "vilgelm"=> "-16599924044988357",
    "viola"=> "-16599924044988358",
    "violetta"=> "-16599924044988359",
    "vissarion"=> "-16599924044988360",
    "vitalij"=> "-16599924044988361",
    "vitya"=> "-16599924044988362",
    "vlada"=> "-16599924044988363",
    "vladislav"=> "-16599924044988364",
    "vladislava"=> "-16599924044988365",
    "voldemar"=> "-16599924044988366",
    "vova"=> "-16599924044988367",
    "vyacheslav"=> "-16599924044988368",
    "yadviga"=> "-16599924044988369",
    "yan"=> "-16599924044988371",
    "yana"=> "-16599924044988372",
    "yaroslav"=> "-16599924044988374",
    "yaroslava"=> "-16599924044988375",
    "yasha"=> "-16599924044988376",
    "yuliana"=> "-16599924044988377",
    "yulya"=> "-16599924044988378",
    "yuna"=> "-16599924044988379",
    "yunona"=> "-16599924044988380",
    "yura"=> "-16599924044988381",
    "zara"=> "-16599924044988383",
    "zarina"=> "-16599924044988384",
    "zhanna"=> "-16599924044988385",
    "zina"=> "-16599924044988387",
    "zoya"=> "-16599924044988388",
    "amina"=> "-16599924044988392",
    "evgenij"=> "-16599924044988393",
    "evgeniya"=> "-16599924044988397",
    "emiliya"=> "-16599924044988404",
    "erika"=> "-16599924044988405",
    "feodosiya"=> "-16599924044988406",
    "illarion"=> "-16599924044988407",
    "larisa"=> "-16599924044988408",
    "lev"=> "-16599924044988409",
    "mikaela"=> "-16599924044988410",
    "rezo"=> "-16599924044988412"
];
?>

<div class="container" <?php if(!empty(App::$current_aggregator)){ ?> style="margin-top:70px;" <?php } ?>>
	<div class="jumbotron text-center mt-3 bg-white shadow-sm" style="padding:0px;">
	<img class="img banner_mobile" style="width: 100%; border-radius: 5px;" src="<?=NFfunctions::getSiteProtocol()?><?=$_SERVER['HTTP_HOST']?>/assets_new/newyear/img/header_backgroud.jpg" alt="Изображение Деда Мороза">
		<center>
			<?
				if(empty($_GET['name'])){
			?>
			<div style="font-size:16pt;max-width:600px;line-height: 1.5;margin:10px;">
					Выберите имя и Дедушка Мороз лично поздравит ваших детей, близких и друзей с Новым годом.
				</div>
				<div class="input-group my-4" style="max-width:500px;margin:5px;">
					<div class="input-group-prepend">
						<span class="input-group-text" style="font-size:10pt;">Кого поздравляем?</span>
					</div>	
					<select class="custom-select col" onchange="top.location=this.value" style="border-radius: 0 30px 30px 0;">
						<option value="" >Выберите имя</option>
						<? 
							$variants_name = [];
							foreach($names as $name_top) {
								foreach($name_top['variants'] as $variant_name) {
									if(empty($variants_name[$variant_name])){
										$variants_name[$variant_name] = [$variant_name, $name_top['translit'],  $name_top['genitive']];
									}
								}
							}
							sort($variants_name);
							foreach($variants_name as $variant_name){
						?>
						<option value="<?=NFfunctions::getSiteProtocol()?><?=$_SERVER['HTTP_HOST']?>/mobile/newyear?name=<?=$variant_name[1]?>&genitive=<?=$variant_name[2]?>"><?=mb_convert_case($variant_name[0], MB_CASE_TITLE)?></option>
						<?
							}
						?>
					</select>
				</div>
				<div style="font-size:14pt;margin:10px;max-width:700px;line-height: 1.5;padding-bottom:50px;">
					Спасибо! Примите бесплатный подарок от нашей команды и mail.ru! </br></br>
					Напишите имя ребёнка или близкого человека, которого хотите поздравить. Мы передадим это Дедушке Морозу, и через несколько секунд вы получите видеоролик с именным поздравлением. </br></br>
					Добрый волшебник лично обратится к ребёнку с экрана компьютера и поздравит его с наступающим Новым годом.
				</div>
			<?
			} else {
			?>
				<div style="font-size:18pt;margin:10px;max-width:500px;line-height: 1.5;">
					Видео-письмо от <b>Деда Мороза</b> для <b><?=$_GET['genitive']?></b>!
				</div>
				<div style="font-size:10pt;margin:10px;max-width:500px;line-height: 1.5;">
					Ваше видео будет доступно по ссылке (сделайте скрин, чтобы не потерять)
					<?=NFfunctions::getSiteProtocol()?><?=$_SERVER['HTTP_HOST']?>/mobile/newyear
				</div>
				<a href="https://my.mail.ru/video/embed/<?=$video[$_GET['name']]?>" style="font-size:14pt;">Смотреть видео-поздравление</a>
				<div style="font-size:14pt;margin:10px;max-width:700px;line-height: 1.5;padding-bottom:10px;">
					Снимайте видео-реакции в сторис и отмечайте нас!
				</div>
				<div style="font-size:14pt;margin:10px;max-width:700px;line-height: 1.5;padding-bottom:50px;">
					Если вы хотите, чтобы <b>Дедушка Мороз</b> поздравил другого вашего ребенка
					или близкого человека, напишите его имя
					<a href='<?=NFfunctions::getSiteProtocol()?><?=$_SERVER['HTTP_HOST']?>/mobile/newyear' class="btn btn-lg text-white btn-block btn-rounded shadow" style="background:<?=App::$current_organization->main_color_c?>;padding-top:5px;padding-bottom:5px;"><span>Написать имя</span></a>
				</div>
			<?
				}
			?>
		</center>
	</div>
</div>